[
{"id":"ea0eb115-8198-4b1f-945a-7ba38d0579d3","releaseYear":"1976","title":"Watcher in the Attic","origin":"Japanese","director":"Noboru Tanaka","cast":"Junko Miyashita","genre":"roman porno","wikiPage":"https://en.wikipedia.org/wiki/Watcher_in_the_Attic","plot":"In 1923 Tokyo Lady Minako is the owner of a shabby boarding house with a collection of bizarre characters for tenants. Gōda, one of her tenants, spends most of his time in the attic spying on the other tenants through holes he has drilled into the ceiling. During one of his peeping sessions, Gōda witnesses the murder of one of the tenants at the hand of Lady Minako. Gōda becomes obsessed with Lady Minako, and determines to commit a grotesque murder in order to prove to her that he is her soul mate. He kills another tenant - a priest - by dripping poison into his mouth through the ceiling. A series of grotesque murders follow. The film ends apocalyptically with the Great Kantō earthquake which kills both of them during their intercourse.[3][4][5]"},
{"id":"f4f2fc4f-e137-41cd-87d3-db0ae1b3502c","releaseYear":"1976","title":"Yakuza Graveyard","origin":"Japanese","director":"Kinji Fukasaku","cast":"Tetsuya Watari","genre":"yakuza","wikiPage":"https://en.wikipedia.org/wiki/Yakuza_Graveyard","plot":"A police investigator cracks down on yakuza business, but once he realizes the police are in negotiations with certain factions, he sides with his own syndicate of choice."},
{"id":"f10dfc47-0242-49e2-894d-30c5ceb56866","releaseYear":"1978","title":"Empire of Passion","origin":"Japanese","director":"Nagisa Oshima","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Empire_of_Passion","plot":"The plot revolves around a young man who has an affair with an older woman. He is very jealous of her husband and decides that they should kill him. One night, after the husband has had plenty of shōchū to drink and is in bed, they strangle him and dump his body down a well. To avert any suspicions, she pretends her husband has gone off to Tokyo to work. For three years the wife and her lover secretly see each other. Finally, suspicions become very strong and people begin to gossip. To make matters worse, her husband's ghost begins to haunt her and the law arrives to investigate her husband's disappearance."},
{"id":"fbed73e3-5327-4c53-b853-6a97710d670d","releaseYear":"1979","title":"Resurrection of the Golden Wolf !The Resurrection of the Golden Wolf","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Resurrection_of_the_Golden_Wolf","plot":"Tetsuya Asakura, a mild-mannered accountant works for an oil company by day and as a bank-robbing assassin by night. Hell-bent on bringing his corporation down, he finds he's not the only one as another criminal blackmails the top officials from the corporation. As loyalties are tested and double-crossed, Asakura soon finds himself in a deadly battle with the mafia."},
{"id":"002a10ac-cb0b-42d8-b007-2c3bc5be0826","releaseYear":"1980","title":"Denziman Movie","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Denshi_Sentai_Denziman","plot":"3000 years ago, the Vader Clan, led by Queen Hedrian, devastated the planet Denzi. Denziland, an island from Denzi, landed on Earth. In modern times, the computer of Denziland awoke the Denzidog IC when it detected the Vader Clan approaching Earth. IC found five young people (who may or may not be descendants of the Denzi people) to become the Denzimen in order to defend Earth, the Vader Clan's next target."},
{"id":"619fcf25-4bab-48ed-81ed-af143395145d","releaseYear":"1982","title":"Goggle V Movie","origin":"Japanese","director":"Unknown","cast":"","genre":"sci-fi for children","wikiPage":"https://en.wikipedia.org/wiki/Dai_Sentai_Goggle_V","plot":"The Dark Science Empire Desdark launches its scheme for world conquest from their Destopia Castle in Germany. Dr. Hideki Hongo, founder of the Future Science Laboratory, is saved from one of their attacks by world class explorer Kenichi Akama. Using his Computer Boys & Girls, Hongo recruits five people, including Akama, to form the Dai Sentai Goggle-V (Goggle 5), the only force capable of stopping Desdark."},
{"id":"9cce4306-bb96-4b8d-8ef3-bb84ad185ff7","releaseYear":"1984","title":"Tora-san's Forbidden Love","origin":"Japanese","director":"Yoji Yamada","cast":"Kiyoshi Atsumi","genre":"comedy","wikiPage":"https://en.wikipedia.org/wiki/Tora-san%27s_Forbidden_Love","plot":"In the midst of Japan's rising economy of the mid-1980s, the itinerant Tora-san becomes drunk with a hard-working company section chief. After an hour commute, the two sleep off their night's revelry at the section chief's home in Ibaraki Prefecture. When the section chief disappears due to the pressure of his job, Tora-san helps his wife to find the man, while secretly hoping they do not, as he has fallen in love with her.[2][3]"},
{"id":"14061a76-8a04-4cc0-b757-d1a8c368d027","releaseYear":"1987","title":"Maskman Movie","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Hikari_Sentai_Maskman","plot":"Commander Sugata is a scientist and sage who excels in mental reinforcements and is a master of every martial arts discipline. He discovered the existence of the Underground Empire Tube, a once peaceful kingdom that has turned into a malignant force under the mysterious Zeba, who desires to conquer the surface. In order to stand against them and thwart their plans, Sugata recruits five young people to become the Maskmen. Each becomes specialized in a style of martial arts, and Sugata teaches them the ways of the mystical "},
{"id":"1b16f2d4-cad4-4618-9a23-e72a97cf716f","releaseYear":"1987","title":"Zegen","origin":"Japanese","director":"Shōhei Imamura","cast":"Mitsuko Baisho","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Zegen","plot":"It is the story of Iheiji Muraoka, who built brothels for the Japanese military."},
{"id":"fd7e9ea1-da20-4af6-88c6-9f59a09d5352","releaseYear":"1989","title":"Turboranger Movie","origin":"Japanese","director":"Unknown","cast":"","genre":"action for children","wikiPage":"https://en.wikipedia.org/wiki/Kousoku_Sentai_Turboranger","plot":"Twenty thousand years ago, the Fairy race assisted humans in a battle against the Bōma Tribes and sealed them away. Due to modern day pollution and man's destruction of nature, the power of Fairy magic has weakened, allowing the seal to be broken and the Tribes escape. With the help of Dr. Dazai, Seelon, the last of the fairies, summoned five high school seniors. As children, they were showered with the "},
{"id":"dd133a77-542e-4b52-b9b1-2b33ff097ef1","releaseYear":"1993","title":"Kamen Rider ZO","origin":"Japanese","director":"Keita Amemiya","cast":"","genre":"tokusatsu","wikiPage":"https://en.wikipedia.org/wiki/Kamen_Rider_ZO","plot":"Masaru Aso is the laboratory assistant of geneticist Doctor Mochizuki. He is used in one of Mochizuki's experiments related to the creation of the Neo Organism, enabling him to transform into the grasshopper-like Kamen Rider ZO. He flees to the mountains and lapses into a two-year coma before he is awakened by a telepathic call to protect Hiroshi Mochizuki, Mochizuki's son. After an attempt to discover the meaning of his transformation at Mochizuki Genetics, Masaru senses that Hiroshi in danger and saves the boy from Doras as ZO. Masaru then reveals himself to Reiko and her karate class. ZO battles Koumori Man to cover Hiroshi and Reiko's escape, but they are sucked into a pocket dimension by Kumo Woman (which was created by Doras). ZO saves them and kills Kumo Woman; Koumori Man snatches Hiroshi, with ZO in pursuit. After he saves Hiroshi, Masaru tells Seikichi that Mochizuki used him in his experiments. Refusing to believe it, Hiroshi runs off. Masaru finds him and fixes his watch, recognizing the melody which awakened him as he helps Hiroshi cope with the revelation. Koumori Man assumes Mochizuki's form to lure Hiroshi away, and Doras knocks Masaru unconscious. Making his way to a complex, ZO kills Koumori Man. He finds Hiroshi and Dr. Mochizuki, learning that the geneticist was the one who woke him up and that the Neo Organism has been acting independently to become a perfect being. When ZO tries to fight Doras, he is absorbed by the Neo Organism and Doras uses Hiroshi to force Mochizuki to complete its evolution. The watch keeps Doras at bay as ZO escapes from the monster, and Mochizuki sacrifices himself to destroy the pool (the Neo Organism's life source). The complex self-destructs as ZO and Hiroshi escape. Leaving the boy with Seikichi, Masaru leaves for parts unknown."},
{"id":"0a0265ff-77ee-4ffb-9534-a68822a59bb4","releaseYear":"1993","title":"Mermaid's Scar","origin":"Japanese","director":"Morio Asaka","cast":"","genre":"anime drama mystery fantasy","wikiPage":"https://en.wikipedia.org/wiki/Mermaid%27s_Scar","plot":"According to an ancient Japanese legend, mermaid flesh may grant immortality if eaten. However, there is a much greater chance that consumption will lead to death or transformation into a damned creature known as a Lost Soul (or Deformed Ones in the English dub). Mermaid Saga tells the tale of Yuta, an immortal who has been alive for five hundred years. Throughout the series, he wanders across Japan searching for a cure and meets others whose lives have also been ruined by mermaid flesh."},
{"id":"a5a78655-1720-4bb1-9a65-0aa4acd4c515","releaseYear":"1994","title":"Kakuranger Movie","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Ninja_Sentai_Kakuranger","plot":"Four hundred years ago, the ninja and the Youkai had a great war. The legendary Sarutobi Sasuke and four other ninjas sealed the Youkai Commander Nurarihyon and all his Youkai's energies away in a cave protected by the "},
{"id":"0c2e20ae-fc4e-4cb2-870c-97cd0713fc5d","releaseYear":"1994","title":"Kamen Rider J","origin":"Japanese","director":"Unknown","cast":"","genre":"tokusatsu","wikiPage":"https://en.wikipedia.org/wiki/Kamen_Rider_J","plot":"After conducting a praying ceremony, the three oldest children of the alien Fog Mother hunt for an ideal human to feed to their newly hatched siblings. They find Kana, the younger sister of environmentalist reporter Kouji Segawa, when he is investigating pollution at the lake. Protecting Kana from the villains as they escape, Kouji is thrown over a cliff by the reptilian Agito and dies; Kana is taken by the insectoid, Zu. Kouji is resurrected by the Earth Spirits as Kamen Rider J to fight the Fog Mother with the Earth Spirits' emissary, Berry, as his guide. With Fog Mother sensing Kouji's presence, Agito tries to finish the job and is killed by J. Kouji enters the Fog Mother's domain, facing Zu in her true form. J kills Zu as they crash into the fortress which is Fog Mother. After Zu dies, Kouji learns about Fog's intention to let her new brood devour humanity as Garai completes the ritual, sends Kana to the hatching chamber and manhandles Kouji. Berry intervenes to free Kana from Fog's spell before he is struck down by Garai; Kana is sent down to her death, and Fog Mother begins attacking a nearby city to prepare for her children's awakening. J fights Garai in his true form (Cobra Man) in a heated battle. After he kills Garai, J is digested by Fog Mother as he tries to save Kana. Absorbing the life energy around him, J kills Fog Mother's newborn offspring, escapes from her bowels and assumes the Jumbo Formation. After ripping Kana out of Fog Mother, J kills the monster. Escaping Fog Mother's destruction, Kouji brings Kana to a peaceful place as Berry watches from a distance."},
{"id":"74713cdc-2ee7-483d-9f0a-c0a3790cf779","releaseYear":"1995","title":"Ohranger Movie","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Ch%C5%8Driki_Sentai_Ohranger","plot":"In the year 1999, the Machine Empire of Baranoia, led by Emperor Bacchushund, invades Earth with the intention of wiping out all human life and bringing about machine rule. Chief Counsellor Miura revives super energies that had been born of the lost civilization of Pangaea. Assembling pieces of a stone plate uncovered three years previously, he reveals the secrets of "},
{"id":"2858834a-7b51-4c21-9d57-e6a2c0248c52","releaseYear":"1997","title":"Carranger vs. Ohranger","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Gekisou_Sentai_Carranger","plot":"Five workers from the Pegasus Auto Garage discover Dappu, an alien from planet Hazard. He empowers the five with the "},
{"id":"5d22e3c5-c01b-41f8-aa08-80b4cda6b626","releaseYear":"1997","title":"The Eel","origin":"Japanese","director":"Shohei Imamura","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Eel_(film)","plot":"Acting on the advice of an anonymous note, Takuro Yamashita (Kōji Yakusho) returns home early one night to find his wife in bed with another man. He kills her and then turns himself in to the police. After being released from prison, he opens a barber shop and brings along a pet eel which he talks to while mostly ignoring conversation with others. He helps save Keiko Hattori (Misa Shimizu) from a suicide attempt, resulting in her working at the shop. She starts developing romantic feelings for him, but he acts nonchalant and refuses the boxed lunches she prepares for him when he goes eel-hunting with the fisherman Jukichi Takada. Takuro recognizes the local garbageman from prison and the garbageman starts to stalk Takuro and Keiko, believing that Takuro isn't repentant enough for his crimes. He attempts to rape Keiko and leaves a letter revealing Takuro's past on the door of his barber shop, but it is removed by Takada. Keiko finds out that she is pregnant with the baby of Eiji Dojima (Tomorowo Taguchi), a loan shark, and that it is too late for an abortion. One night the garbageman goes to Takuro's shop and lectures him, accusing him of killing his wife out of jealousy. The two get into an altercation and Takuro fends him off. Keiko goes back to her old company, where she is the vice-president, and retrieves her mother's bankbook. This results in Dojima angrily going to the barber shop, along with henchman, and accusing her of theft since he was planning to reinvest the funds into his business. Dojima's group and Keiko's fight, with the false revelation that Keiko is pregnant with Takuro's child. The police find that Keiko's mother never signed power of attorney papers for Dojima, but a parole violation meeting for Takuro causes him to be sent back to prison for a year. Takuro lets his eel go and accepts a boxed lunch from Keiko, who promises to wait for him with her baby."},
{"id":"a52ef880-f2fe-494b-94ad-56198b1126e4","releaseYear":"1998","title":"Megaranger vs. Carranger","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Denji_Sentai_Megaranger","plot":"Kenta Date, a senior high school student, is the ultimate champion of an arcade video game called "},
{"id":"62f633d0-42ff-4073-a04a-8516b8fcfe9c","releaseYear":"1999","title":"Nobita Drifts in the Universe","origin":"Japanese","director":"Tsutomu Shibayama","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Doraemon:_Nobita_Drifts_in_the_Universe","plot":"The film is the second in the series to parody the original Star Wars trilogy. In the film, Doraemon and friends find themselves in an interstellar war where an army (based on the Galactic Empire) is trying to take over Earth. Of course, our heroes joins another army (based on the Rebel Alliance) to stop the antagonists."},
{"id":"3c14a60c-1093-49db-a5a8-78df119347f8","releaseYear":"1999","title":"Yu-Gi-Oh!","origin":"Japanese","director":"Junji Shimizu","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Yu-Gi-Oh!_(film)","plot":"Yu-Gi-Oh! tells the tale of Yugi Mutou, a timid young boy who loves all sorts of games, but is often bullied around. One day, he solves an ancient puzzle known as the Millennium Puzzle (千年パズル, Sennen Pazuru), causing his body to play host to a mysterious spirit with the personality of a gambler. From that moment onwards, whenever Yugi or one of his friends is threatened by those with darkness in their hearts, this other Yugi shows himself and challenges them to dangerous Shadow Games (闇のゲーム, Yami no Gēmu, lit. "},
{"id":"949f31d6-f414-4b11-8b2d-5fb0ba93c854","releaseYear":"2001","title":"Blue","origin":"Japanese","director":"Hiroshi Ando","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Blue_(2001_film)","plot":"Kayako Kirishima, in her third year at a high school, feels a sense of isolation in school life and vague admiration and uneasiness about the future. One day she makes friends with Endō, who is isolated from her surroundings because she remained in the same class for another year. Kayako is strongly attracted by Endō, who shows her a world that she didn't know."},
{"id":"89c8626e-4712-4a29-8a27-7a5652ab7bbb","releaseYear":"2001","title":"Desert Moon","origin":"Japanese","director":"Shinji Aoyama","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Desert_Moon_(2001_film)","plot":"The film's main theme is the conflict between work and family commitments in modern Japan. It focuses on a successful internet entrepreneur Nagai (Hiroshi Mikami), whose wife Akira (Maho Toyota) and young daughter Kaai (Yukiko Ikari) left him because he neglected them for his business. A young hustler Keechie (Shuji Kashiwabara), who has emotion problems concerning his own father, becomes involved in the family's drama."},
{"id":"af5e3a32-9899-44e5-aa6e-ca028993ae71","releaseYear":"2001","title":"Distance","origin":"Japanese","director":"Hirokazu Koreeda","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Distance_(film)","plot":"Members of a cult, modeled on Aum Shinrikyo, sabotage a city's water supply, then commit mass suicide near the shores of a lake. Family members (the credited cast, minus Asano) of the perpetrators meet at the lake to observe the anniversary of their loved ones' deaths. They meet a former member of the cult (Asano), who had trained for the water sabotage attack but defected at the last minute. He leads them to the cabin where he and the deceased cult members had trained for the attack, and they pass the night reminiscing about those they'd known and lost, shown cinematically through improvised dialogues and flashbacks. Sakata, the aforementioned surviving cult and last to see most of the departed alive, and Atsushi (Arata) interrogate one another about Yûko (played by actress/model Ryo), Atsushi's sister, whom Sakata had asked to run away with him the night before the attack."},
{"id":"201a8143-bdfd-494b-8d6d-0da79349bf07","releaseYear":"2001","title":"Inuyasha the Movie: Affections Touching Across Time","origin":"Japanese","director":"Unknown","cast":"","genre":"fantasy anime","wikiPage":"https://en.wikipedia.org/wiki/Inuyasha_the_Movie:_Affections_Touching_Across_Time","plot":"Inuyasha's father defeated a powerful Chinese yōkai moth named Hyōga, five hundered years ago. The Shikon Jewel shard revives his son, Menōmaru, and his loyal servants, Ruri and Hari (who plan to avenge their family). When Miroku and Sango meet the duo, Ruri copies the wind tunnel and Hari possesses Kirara. Menōmaru kidnaps and places a spell on Kagome. He breaks the seal to release the power of his predecessors. Though becoming stronger, he achieves the title of the clan. While staying at the tree fortress, Menōmaru uses the spell to possess Kagome. Inuyasha attempts to evade Kagome, when he discovers that she is wearing Kikyō's clothes. Kagome inadvertently kills Inuyasha, pinning him with an arrow on "},
{"id":"c347c370-3c4b-4a4a-9bfd-41b09d3d4b82","releaseYear":"2002","title":"Hurricanger Movie","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Ninpuu_Sentai_Hurricaneger","plot":"In the Hayate Way's Ninja Academy, three pupils are not exactly fitting in. But because their sensei believes they have potential he regularly spends the morning personally and rigorously training them. While the other students are having their graduation ceremony a group of evil space ninjas known as the Jakanja infiltrate the school killing most of the students. The school's sensei, Mugensai, turns himself into a hamster to evade his pursuers. The trio is then taken to a secret base to become the legendary Hurricangers to fight Jakanja. Later in the series they have to fight with the two ninja brothers of the Ikazuchi Way's Ninja Academy due to their respective schools' rivalries. With the aid of the mysterious Shurikenger the two ninja groups set their rivalry aside and join forces to stop Jakanja."},
{"id":"8551bb93-5a50-47a2-8393-adea9e82c1a8","releaseYear":"2002","title":"Hurricanger vs. Gaoranger","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Ninpuu_Sentai_Hurricaneger","plot":"In the Hayate Way's Ninja Academy, three pupils are not exactly fitting in. But because their sensei believes they have potential he regularly spends the morning personally and rigorously training them. While the other students are having their graduation ceremony a group of evil space ninjas known as the Jakanja infiltrate the school killing most of the students. The school's sensei, Mugensai, turns himself into a hamster to evade his pursuers. The trio is then taken to a secret base to become the legendary Hurricangers to fight Jakanja. Later in the series they have to fight with the two ninja brothers of the Ikazuchi Way's Ninja Academy due to their respective schools' rivalries. With the aid of the mysterious Shurikenger the two ninja groups set their rivalry aside and join forces to stop Jakanja."},
{"id":"d4c52117-c2b6-4920-a193-f3b1070243f5","releaseYear":"2003","title":"Abaranger Deluxe","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Bakuryuu_Sentai_Abaranger","plot":"Scientists believe that 65,000,000 years ago, a meteorite's crash on Earth killed off the dinosaurs, but in truth, it split Earth into two parallel universes: Dino Earth (ダイノアース, Daino Aasu), an Earth where dinosaurs were still the superior species, and our Earth, referred to as Another Earth (アナザーアース, Anazaa Aasu) by the residents of Dino Earth. Overtime, the Dragon People (竜人, Ryujin) and Bakuryū (爆竜) races came into being on Dino Earth but were at war with the Evoliens, entities that emerged from the meteor. The two Earths are separate until Asuka, one of the Dragon People from Dino Earth, arrives on Earth via a transdimensional portal. However, he is followed by the Evoliens in their Anamolicarus spaceship and the three Bakuryū under their control. As the Bakuryū Tyrannosaurus, Ptreranodon, and Triceratops attack Tokyo, a call is sent out to three destined ones who possess Dino Guts (ダイノガッツ, Daino Gattsu) to gain the powers to tame the three beasts. Together with their Bakuryū partners, the three become Abarangers to protect their dimension from the Evoliens. In time another Abaranger appears, but he takes the name "},
{"id":"b85f233d-7782-47b1-ab54-2cb958d974d0","releaseYear":"2003","title":"Detective Conan: Crossroad in the Ancient Capital","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Detective_Conan:_Crossroad_in_the_Ancient_Capital","plot":"Heiji Hattori searches for a girl he fell in love with after he saw her playing outside a temple when he was little. Meanwhile, Kogoro, Ran, Conan, and Sonoko go to Kyoto and meet up with Heiji and Kazuha to investigate a robbery and several murders. The killer tries to kill Heiji several times and severely injures Heiji. The killer kidnaps Kazuha, but Heiji collapses before he can reach her. Conan swallows a pill Haibara gave him and a bottle of wine, temporarily turning him back into Shinichi. He disguises himself as Heiji and attempts to arrest the killer and save Kazuha and manages to stall the murderer until Heiji arrives. Using kendo, Heiji fights the culprit while Shinichi runs into the woods to hide while his transformation into Conan occurs. In the woods, Shinichi bumps into Ran and stuns Ran with his tranquilizer watch to prevent her from seeing his transformation into Conan. Conan then reaches Heiji and Kazuha in time to save them by kicking sticks of fire at the culprit. The culprit continues to fight Heiji and manages to push the Osaka detective to the edge of the roof. Conan kicks a soccer ball at the enemy, giving Heiji time to regain his footing. In the end, Heiji finds out that the girl from his childhood was Kazuha and does not tell Kazuha that she is the girl he was looking for."},
{"id":"6ae6ff2a-c6df-479a-8189-d76549e2a379","releaseYear":"2003","title":"Gozu","origin":"Japanese","director":"Takashi Miike","cast":"","genre":"horror","wikiPage":"https://en.wikipedia.org/wiki/Gozu","plot":"Structurally, Gozu is a succession of bizarre scenes sandwiched between a storyline involving Minami’s search for his Yakuza brother Ozaki in a small town, that is reminiscent of the episodic quests in Greek Mythology.[2]"},
{"id":"34207bf2-0515-4a0a-934b-a8a925ad14e6","releaseYear":"2004","title":"Abaranger vs. Hurricanger","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Bakuryuu_Sentai_Abaranger","plot":"Scientists believe that 65,000,000 years ago, a meteorite's crash on Earth killed off the dinosaurs, but in truth, it split Earth into two parallel universes: Dino Earth (ダイノアース, Daino Aasu), an Earth where dinosaurs were still the superior species, and our Earth, referred to as Another Earth (アナザーアース, Anazaa Aasu) by the residents of Dino Earth. Overtime, the Dragon People (竜人, Ryujin) and Bakuryū (爆竜) races came into being on Dino Earth but were at war with the Evoliens, entities that emerged from the meteor. The two Earths are separate until Asuka, one of the Dragon People from Dino Earth, arrives on Earth via a transdimensional portal. However, he is followed by the Evoliens in their Anamolicarus spaceship and the three Bakuryū under their control. As the Bakuryū Tyrannosaurus, Ptreranodon, and Triceratops attack Tokyo, a call is sent out to three destined ones who possess Dino Guts (ダイノガッツ, Daino Gattsu) to gain the powers to tame the three beasts. Together with their Bakuryū partners, the three become Abarangers to protect their dimension from the Evoliens. In time another Abaranger appears, but he takes the name "},
{"id":"c9e4ae7d-a57e-42c6-ba53-375916316d4c","releaseYear":"2004","title":"Beyblade: The Movie - Fierce Battle","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Beyblade:_The_Movie_-_Fierce_Battle","plot":"The movie begins with the battle of Tyson with a boy in BBA Final Tournament of World Championships. Just as the battle ends, a mysterious boy named Daichi enters the stadium, challenging Tyson to battle with him. Tyson reluctantly agrees and both launch their blades. On the other hand, a man name Professor Tengai takes his students to a trip in an ancient ruins where he explains to them, are hidden dark bit beasts sealed to rest by an ancient king. Back in the fight, Tyson starts to defeat Daichi who, in rage, starts empowering his blade and a scar on his forehead lightens up. In the ancient ruins, because of that scar's mysterious light, a rock breaks to reveal a secret chamber.Daichi is defeated back at the stadium but another story has begun in the ruins. The Professor and his students enter the hidden cave in awe and reach a mysterious hall with a stone table in the middle. They reach it and suddenly the bit beast which were sealed in the walls of the hall become free and enslave the four children.They become evil and imprison the Professor because their memory is lost. Tyson soon comes to know throughout the movie that those dark bit beasts now want to seal the light bit beasts of the four blade breakers, and that those bit beasts are actually the dark versions of the four sacred bit beasts. Finally, a great battle takes place in which the blade breakers are victorious. The dark beasts are once again put to rest with the whole ruins collapsing in the end."},
{"id":"ad413d99-9887-4775-942b-f95e357349fb","releaseYear":"2004","title":"One Piece the Movie: Curse of the Sacred Sword","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Curse_of_the_Sacred_Sword","plot":"Zoro is lured away from the crew by henchmen of his childhood friend Saga. In search of Zoro, the Straw Hats encounter the young priestess Maya. Luffy and Usopp get lost and meet Saga, while Saga's men attack Maya's village. Zoro, alongside them, takes three purple orbs from Maya, which none of Saga's men can touch. Luffy fights Saga, but during the encounter falls off a high cliff, causing Usopp to jump after him. Zoro returns to Saga with the orbs and disposes of them in a well. Luffy and Usopp find an underground tunnel system and explore it. There they stumble upon the orbs and take them along. While in the village the remaining Straw Hats hear about the evil Seven-Star Sword, that has taken control of Saga, and the stolen orbs needed to seal the sword's power, when Luffy and Usopp emerge from the ground in front of them. After hearing the story, the Straw Hats decide to help. Zoro learns that Saga is controlled by the Seven-Star Sword and that Saga plans to make him the sword's first sacrifice. They start a fight during which Zoro attempts to destroy the cursed blade. Using the orbs, Maya performs a ritual to keep the sword's power from fully awakening. Saga defeats Zoro, but before he can kill him, the ritual catches his attention and he hurries to interrupt it. After that, with the sword's power unfolding, Saga fights Luffy a second time. During their fight, the sword crumbles and its power is transferred into Saga's body. Zoro appears, takes over for Luffy, and defeats his old friend. After the cursed power leaves Saga's body and his mind is freed from the evil influence, the Straw Hats set sail for their next adventure."},
{"id":"547df518-6a35-4537-b636-5e6de4f3e367","releaseYear":"2005","title":"Bashing","origin":"Japanese","director":"Masahiro Kobayashi","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Bashing_(film)","plot":"Yuko Takai and a few other Japanese political activists in the Middle East were kidnapped and used as hostages. Upon returning to Japan, Yuko is mistreated for basically "},
{"id":"9f3e942a-1f34-4613-884e-fde7a28bfdc4","releaseYear":"2005","title":"Strange Circus","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Strange_Circus","plot":"School principal Ozawa Gozo rapes his daughter, Mitsuko, after she sees her parents having sex. Her mother Sayuri witnesses the rape. Gozo now rapes both of them as he pleases, while his family is undermined by incest, suicide, and murder... such is the erotic novel wheelchair-bound novelist Taeko sets out to write. She is assisted by Yuji, a young man who is actually on a mission to uncover the reality of this story of Taeko's past, and of the locked room in her apartment. But the reality and truth beneath the Grand Guignol nightmares Taeko creates might be too much to bear."},
{"id":"6a36bf74-969c-4ec5-98e1-d54ad721a2c8","releaseYear":"2005","title":"A Stranger of Mine","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/A_Stranger_of_Mine","plot":"In one long Friday evening, Takeshi Miyata (Yasuhi Nakamura), a straight-arrow businessman, will encounter a number of people (some only fleetingly) who have intertwining fates. The plot of the film is presented in succession first from the point of view of Maki Kuwata (Reika Kirishima), a young woman disappointed in love, then from Takeshi's point of view, then of his friend, Yusuke Kanda (Sō Yamanaka), a private detective, then of Takeshi's former girlfriend, Ayumi Kurata (Yuka Itaya), then of a wannabe-tough Yakuza, Asai (Kisuke Yamashita)."},
{"id":"f72368d2-961d-4361-a90e-c49c648f2883","releaseYear":"2005","title":"Tetsujin 28: The Movie","origin":"Japanese","director":"Shin Togashi","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Tetsujin_28-go","plot":"In the final phase of the Pacific War, the Imperial Japanese Army were developing a gigantic robot "},
{"id":"20a5a2bd-bffa-4b83-9f79-a04bd6c0c1aa","releaseYear":"2005","title":"Tomie: Beginning","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Tomie:_Beginning","plot":"This installment deals with the chain of events that occurred right before the first film takes place. Tomie (Rio Matsumoto) shows up as a transfer student at a high school, quickly enchanting all the males, and raising the ire of the females. As is often the case in the Tomie films, she fixates on one solitary girl whom she befriends, with overt lesbian overtones. She displays all of her typical powers, and it isn't long before the murders and madness begin. This movie introduces the teacher who promises to kill her no matter how many times he has to do so."},
{"id":"d36fa8cb-22bb-4a18-9759-696b282ddd3f","releaseYear":"2005","title":"Tomie: Revenge","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Tomie:_Revenge","plot":"Tomie is played by Anri Ban. The story revolves around a young, female doctor, and an unidentified naked woman she runs down on the road one night. In her search for the wounded girl (who has a mole under her left eye) the doctor ends up in an abandoned house filled with bodies, madmen and an unconscious girl. She then discovers Tomie and madness begins yet again."},
{"id":"d8d8b44c-79c8-4402-aeca-1f7a5f3f2172","releaseYear":"2006","title":"The Uchōten Hotel","origin":"Japanese","director":"Kōki Mitani","cast":"Kōji Yakusho","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Uch%C5%8Dten_Hotel","plot":"The plot involves numerous characters, the different problems or situations they face in the run-up to midnight, and the ways that these different storylines interact and are resolved. The various storylines include:"},
{"id":"088b4fbd-ff52-4c12-995c-d59bc50d289b","releaseYear":"2006","title":"Boukenger the Movie: The Greatest Precious","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Gougou_Sentai_Boukenger","plot":"Powerful relics known as Precious have started to appear throughout the world. However, the various Negative Syndicates wish to take the Precious for themselves and utilize them for evil means. To make sure that the Precious do not fall into the hands of the Negative Syndicates, the Search Guard Successor Foundation has developed its own special operations team, the Boukengers, to do battle and collect some of the more dangerous Precious."},
{"id":"5d36adec-234b-4153-865a-1e5c8bf27034","releaseYear":"2006","title":"Tokyo Friends: The Movie","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Tokyo_Friends:_The_Movie","plot":"At the end of the TV series, Rei began to gain fame as a rising vocalist for The Survival Company. Ryuuji's band though was involved in triad activities and was disbanded. Ryuuji moved to New York City to restart his life. Upon discovering that Ryuuji is in New York, Rei flew to New York to meet him just before an important concert that could make her a real star in Japan.[2]"},
{"id":"29fc3c8a-e1ba-4170-9524-c88e1c717f1f","releaseYear":"2007","title":"Anata wo Wasurenai","origin":"Japanese","director":"Hanadou Junji","cast":"","genre":"biopic","wikiPage":"https://en.wikipedia.org/wiki/Anata_wo_Wasurenai","plot":"The film is based on a true story, Soo-hyun (Lee Taesung) travels from Korea, studying in Japan he meets Yuri (High and Mighty Color's lead singer, Maakii). Both share similar interests in music and sports as they become closer while dealing with language and racial barriers."},
{"id":"b716e15e-ba9d-4eb5-bf74-21f02b716ff6","releaseYear":"2007","title":"Gakkō no Kaidan","origin":"Japanese","director":"Hirohisa Sasaki","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Gakk%C5%8D_no_Kaidan_(light_novels)","plot":"Gakkō no Kaidan's story takes place in the Tengurihama Academy, and centers around the male protagonist Yukihiro Kanba who has recently been admitted into the school after being adopted by his uncle. One day, Yukihiro stumbles across Yūko Kokonoe, who sprinted from the stairs behind him before quickly disappearing down the stairs. After Yukihiro stumbles across the gymnastic club, who attempts to recruit Yukihiro before being stopped by Yūko, he is forced to join the "},
{"id":"e2a7f321-1f21-4180-81b3-9514f6ea544f","releaseYear":"2007","title":"Maiko Haaaan!!!","origin":"Japanese","director":"Nobuo Mizuta","cast":"Sadao Abe","genre":"comedy","wikiPage":"https://en.wikipedia.org/wiki/Maiko_Haaaan!!!","plot":"Kimihiko Onizuka (Sadao Abe) is a salaryman infatuated with maiko (apprentice geisha) and whose greatest goal in life is to play a party game called yakyuken with one. Upon being transferred to his company's Kyoto branch, he dumps his coworker girlfriend Fujiko (Kou Shibasaki) and makes his first ever visit to a geisha house. However, when the realization of Kimihiko's lifelong dream is rudely interrupted by a professional baseball star named Kiichiro Naito (Shinichi Tsutsumi), he vows revenge by becoming a pro baseball player himself. Meanwhile, Fujiko decides to become an apprentice geisha. A rivalry between Kimihiko and Naito ensues where they try to out-do each other at baseball, K-1, cooking, acting and even politics."},
{"id":"7d1d3051-0e5b-40f2-b45a-e1133c0bbf45","releaseYear":"2007","title":"Master Of Thunder","origin":"Japanese","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Master_Of_Thunder","plot":"For 1400 years, Spiritual Guardians have watched over the mountains of Japan and defeated the evil spirits there. The nearby Kikyo Temple is rumored to have been the home of these legendary Guardians known as the "},
{"id":"53fc2a11-3298-4780-bdf9-191458fcd0de","releaseYear":"2007","title":"Piano no Mori","origin":"Japanese","director":"Masayuki Kojima","cast":"","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Piano_no_Mori","plot":"Piano no Mori is a story that follows Kai Ichinose, a boy who lives in the red light district but escapes at night to play the piano in the forest. Shuhei Amamiya, the grade-school son of a professional pianist, transfers to Moriwaki Elementary, Kai's elementary school. But it doesn't take long before Shuhei is picked on by the class bullies, and gets involved in a dare to play the mysterious piano in the forest, leading to his meeting with Kai, who seems to be the only one capable of getting sound out of the thought-to-be broken piano. Kai's ability earns him the respect of Shuhei and his music teacher, former master pianist Sosuke Ajino. Both Shuhei and Ajino try to get Kai to take proper piano lessons, but Kai is at first resistant to refining his piano-playing technique. However, after hearing Sosuke play a Chopin piece he just can't seem to play himself, he relents."},
{"id":"f0da14de-8b67-4bed-87b8-86749de70f68","releaseYear":"2007","title":"Summer Days with Coo","origin":"Japanese","director":"Keiichi Hara","cast":"","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Summer_Days_with_Coo","plot":"A small, lone Kappa miraculously survives over 200 years into modern day Tokyo, Japan when he is found by young Koichi. "},
{"id":"4f762b5c-1e83-4a5a-9c4f-8fbc8fa5aac6","releaseYear":"2007","title":"Tetsujin Nijūhachi-gō: Hakuchū no Zangetsu","origin":"Japanese","director":"Yasuhiro Imagawa","cast":"","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Tetsujin_28-go","plot":"In the final phase of the Pacific War, the Imperial Japanese Army were developing a gigantic robot "},
{"id":"a14fbc71-2575-49c2-8a6c-d50e97c35426","releaseYear":"2008","title":"Achilles and the Tortoise","origin":"Japanese","director":"Takeshi Kitano","cast":"Beat Takeshi","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Achilles_and_the_Tortoise_(film)","plot":"Kitano plays Machisu, who is born into a wealthy family, but loses both his parents as a child. When his father (Akira Nakao) commits suicide after the collapse of his business, Machisu's stepmother (Mariko Tsutsui) sends him to live with an aunt and uncle who mistreat him and finally send him to an orphanage. As a young man, Machisu (Yurei Yanagi) attends art school and finds his style of painting challenged by the more experimental and conceptual work turned in by his classmates. Machisu takes a job in order to pay for art school, and strikes up a friendship with a fellow co-worker, Sachiko (Kumiko Aso), who seems to grasp his artistic vision. They get married and have a daughter. As he grows older, Mashisu's obsession with contemporary art controls his whole life, leaving him insensitive of everything around him, including the death of his own daughter (Eri Tokunaga) and his wife's desertion. He tries to please the art critics, remaining penniless. He is caught up in a fire and almost dies. Losing all his previous works, he is left with a single half-burnt soda can, which he assesses at 200,000 yen and tries to sell. This ends up kicked carelessly away when his wife picks him up from the street. They walk away together, seemingly finally rid of his artistic obsession."},
{"id":"8df0e3ac-8061-420f-b2c6-8d4777a7fe2b","releaseYear":"2009","title":"Saikin-rettou","origin":"Japanese","director":"Kenji Murakami","cast":"Naoto Takenaka","genre":"comedy","wikiPage":"https://en.wikipedia.org/wiki/Saikin-rettou","plot":"A mysterious virus with the 100% mortality rate spreads across Japan. Everyone infected with this virus dies without exception, screaming and their heads exploding. After the explosion, their faces turn into a smiling face which strongly resembles Kim Jong-il.[2][3]"},
{"id":"8d54618e-2fe0-4f5d-b5ae-73bc9a89b53c","releaseYear":"2010","title":"Caterpillar","origin":"Japanese","director":"Kōji Wakamatsu","cast":"Shinobu Terajima","genre":"war","wikiPage":"https://en.wikipedia.org/wiki/Caterpillar_(2010_film)","plot":"The film is set in the late 1930s, during the Second Sino-Japanese War. In the first scene, Lieutenant Kurokawa scourges, rapes and disembowels Chinese people during the war. Later, he returns home as a war hero, but with a horribly mutilated body. He is alive but reduced to a torso (no limbs), deaf and mute, with burns covering half of his face, but with three medals on his chest. Despite his condition, he is still constantly eager for sex, which he performs acrobatically with his wife. The sexual acts are rough and are imposed on his wife, who is repelled by him, but who nevertheless feels a duty to take care of him. The film concludes with the disabled veteran Kurokawa committing suicide by dragging himself into a pond outside his home."},
{"id":"f0da6099-1144-4d98-90cd-c8041e01ef3d","releaseYear":"2010","title":"Hutch the Honeybee","origin":"Japanese","director":"Tetsurō Amino","cast":"","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Hutch_the_Honeybee","plot":"Hutch is a male bee who, along with his friends, begins to find his mother, a queen bee, after bees have been attacked by a group of wasps. Hutch makes friends with several other insects and with Ami, a human girl who can talk to them."},
{"id":"13ee13ea-289e-4369-94a9-8c1895b223a9","releaseYear":"2010","title":"Inazuma Eleven: Saikyō Gundan Ōgre Shūrai","origin":"Japanese","director":"Unknown","cast":"","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Inazuma_Eleven_(manga)","plot":"Endou Mamoru is a cheerful goalkeeper in Raimon Jr High, with six other players in the team. But there was a day when the team was almost lead to disbandment by Natsumi unless they are to win the match against the Teikoku Gakuen, currently the best team of Japan. He tried to save the club by gathering four more players to the team. In the second series, Endou and Raimon had to gather players from all over Japan to defeat the new enemies, Aliea Gakuen. In the third series, the Football Frontier International was announced, and Inazuma Japan was assembled, the coach being Kudou Michiya."},
{"id":"e9ed9d36-b360-48c2-899b-3d5e6a1bab1c","releaseYear":"2010","title":"Ōoku","origin":"Japanese","director":"Fuminori Kaneko","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/%C5%8Coku:_The_Inner_Chambers#Film","plot":"In an alternative timeline of feudal Japan, a strange disease that only affects men has caused a massive reduction of male population, thus women have to pick up men's jobs, changing the social structure. Now, after 80 years of the initial outbreak and current man:woman ratio of 1:4, Japan has become completely matriarchal, with women holding important political positions and men being their consort. Only the most powerful woman—head of Tokugawa shogunate—can keep a harem of handsome yet unproductive men, known as "},
{"id":"9084d920-46a0-402b-b9ab-0d42ba58059a","releaseYear":"2010","title":"Planzet","origin":"Japanese","director":"Jun Awazu","cast":"","genre":"anime science fiction","wikiPage":"https://en.wikipedia.org/wiki/Planzet","plot":"In 2047, an unknown, alien life-form, codenamed FOS, attacks Earth, destroying the world’s major cities in one fell swoop. The survivors unite to fight back, and three years later they erect a world shield, the Diffuser, to stop further invasions. Now in 2053, a last, desperate counterattack is being mounted against the FOS. Taishi Akejima, a soldier in the Planetary Defense Forces Alliance, would like nothing better than a shot at the aliens responsible for his father’s death six years ago. However, the new offensive requires a powerful weapon to be deployed and the Diffuser to be disabled, leaving the entire planet terribly vulnerable once more. Will humanity regain the stars or lose everything in the final, ultimate gamble?"},
{"id":"34de2e66-1d07-47ca-855a-5cf87029dd70","releaseYear":"2010","title":"Zebraman: Vengeful Zebra City","origin":"Japanese","director":"Takashi Miike","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Zebraman:_Vengeful_Zebra_City","plot":"By 2025, fifteen years after the events of Zebraman, Tokyo has renamed itself Zebra City, and has instituted a "},
{"id":"43cdc154-bed9-4afd-8218-13178eba5b1d","releaseYear":"2011","title":"Pretty Cure All Stars DX3: Deliver the Future! The Rainbow~Colored Flower That Connects the World!","origin":"Japanese","director":"Takashi Ōtsuka","cast":"","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Suite_PreCure","plot":"In a place called Major Land, a Melody of Happiness is due to be played, spreading happiness throughout the world. However, an evil man named Mephisto steals the Legendary Score, plotting to turn it into a Melody of Sorrow to spread sadness across the land. Aphrodite, the queen of Major Land, scatters the Notes that make up the Legendary Score into the human world and sends a fairy named Hummy to Kanon Town in order to recover them. There, Hummy meets two girls, Hibiki Hojo and Kanade Minamino, who are chosen to become the Suite Pretty Cures in order to recover the missing Notes and protect everyone's happiness."},
{"id":"7b1dc163-6ed2-46f4-a3f7-36c7bed173a2","releaseYear":"2011","title":"Buddha","origin":"Japanese","director":"Kozo Morishita","cast":"","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Buddha_(manga)","plot":"In ancient India, the lives of many people are plagued by drought, famine, constant warfare and injustices in the caste system. The intertwining lives of many unhappy souls are drawn together by the birth of the young prince Siddhartha, who embarks on a spiritual journey, and becomes Gautama Buddha, "},
{"id":"8b1254cc-4cdb-48f4-8388-e8462de54969","releaseYear":"2011","title":"Ninja Kids!!!","origin":"Japanese","director":"Takashi Miike","cast":"Seishiro Kato","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Ninja_Kids!!!","plot":"Set in the Muromachi period in early 16th-century Japan, the young ninja Rantaro (Seishiro Kato) is born into a family of low-ranking ninjas. Rantaro is sent by his father and mother (Shido Nakamura and Rei Dan) to attend the six-year course at a Ninja Academy run by Denzo Yamada (Susumu Terajima). Rantaro's homeroom teacher is Hansuke Doi (Takahiro Miura) and head of the Ninja Girl classes at the school is Shina Yamamoto who appears as either a beautiful young woman (Anne Watanabe) or an older woman (Tamao Nakamura). After going home to his parents' farm for the holidays, Rantaro is joined by his schoolmate Shinbei (Futa Kimura) but they later decided to stay with teacher Doi. One day, some Usetake ninjas arrive at the house of flamboyant hairdresser Yukitaka Saito (Takeshi Kaga) and his son Takamaru (Takuya Mizoguchi) in order to kill both of them. Yukitaka and Takamura used to belong to the Usetake clan, but Rantaro and his friends aim to save them by joining a contest that ends with a race to ring a bell on top of a mountain."},
{"id":"0f3be6a9-bf7f-4436-b8d7-3d80f10d6d64","releaseYear":"2011","title":"Wild 7","origin":"Japanese","director":"Eiichirō Hasumi","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Wild_7","plot":"In the wake of rising criminality and terrorist activities in Japan against Japanese nationals, the Japanese National Police Agency has no choice but to authorize the mobilization of a special Counter-terrorist Motorcycle unit consisting of reformed convicts, ranging from simple thugs, individuals forced into prison for simple petty trouble and former Yakuza henchmen and leaders to combat armed criminals and terrorists."},
{"id":"70576c07-4d09-420f-8e4f-445b7b8b9497","releaseYear":"2012","title":".hack//The Movie","origin":"Japanese","director":"Hiroshi Matsuyama","cast":"Nanami Sakuraba","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/.hack//The_Movie","plot":"The story, taking place in 2024, follows the life of Sora Yuki, a 14-year-old girl persuaded by her friends to play the popular game called "},
{"id":"f1513fbe-db4f-4efc-aab9-c3042fb7d97b","releaseYear":"2012","title":"Doraemon: Nobita to Kiseki no Shima ~Animal Adventure~","origin":"Japanese","director":"Kozo Kusuba","cast":"","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Doraemon:_Nobita_to_Kiseki_no_Shima%E2%80%94Animal_Adventure","plot":"Nobita and his dad buy a big rhinoceros beetle, which he promises to his dad to take good care of it. Later, Doraemon's group finds a strange island where a tribe co-exists with prehistoric creatures long believed to extinct yet preserved by a mythical beetle spirit named Golden Hercules. However, the group has to deal with a group of criminals from the future who intend to capture Golden Hercules for a profit."},
{"id":"d45b4a1f-3aa5-4af6-9ccb-ecb7165eb7fd","releaseYear":"2012","title":"River","origin":"Japanese","director":"Ryūichi Hiroki","cast":"Misako Renbutsu","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/River_(2011_film)","plot":"Hikari's boyfriend is one of those killed in the Akihabara massacre incident. Suffering from the shock of her loss and unable to accept this reality, she cuts herself off from the outside world. She eventually manages to muster enough courage to visit Akihabara, the scene of the incident. There, she encounters many people who are still coming to terms with the aftermath of the incident and are still suffering from the aftereffects."},
{"id":"68f8b74c-4225-4490-93a0-4ce7f2cf62d4","releaseYear":"2012","title":"Naruto the Movie: Road to Ninja","origin":"Japanese","director":"Unknown","cast":"Junko Takeuchi","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Naruto_the_Movie:_Road_to_Ninja","plot":"The leaf ninjas drive off a group of fake Akatsuki members, impressing their families. After Naruto Uzumaki discovers Sakura Haruno arguing with her parents, Tobi uses Limited Tsukuyomi (限定月読, Gentei Tsukuyomi) to transport them into an alternate timeline. The two discover their friends acting oppositely compared with their usual personalities and Sasuke Uchiha being around at the village. While Sakura learns that she is orphaned with her father as the Fourth Hokage, Naruto reunites with his parents. When they obtain the Red Moon Scroll, the masked ninja abducts the repentant Sakura, forcing Naruto to choose between getting her or the scroll. After revealing his possessed counterpart as Menma (メンマ), Naruto purges Tobi from him to cancel the genjutsu and revert the timeline. Sakura apologizes to her parents and Naruto does to Iruka Umino for his mistake. This reminds Naruto that even though he is an orphan, he still has a family."},
{"id":"308b31d2-76db-435e-9f6a-a72bebbdb638","releaseYear":"2012","title":"Another","origin":"Japanese","director":"Takeshi Furusawa","cast":"","genre":"horror","wikiPage":"https://en.wikipedia.org/wiki/Another_(novel)","plot":"In 1972, Misaki, a popular student of Yomiyama North Middle School's class 3-3, suddenly died partway through the school year. Devastated by the loss, the students and teacher behaved like Misaki was still alive, leading to a strange presence on the graduation photo. In Spring 1998, Kōichi Sakakibara transfers into Yomiyama's class 3-3, where he meets Mei Misaki, a quiet student whom their classmates and teacher seemingly ignore. The class is soon caught up in a strange phenomenon, in which students and their relatives begin to die in often gruesome ways. Realizing that these deaths are related to the "},
{"id":"ad9a4b50-fefe-4d9c-ae03-07c546188ade","releaseYear":"2012","title":"Afterschool Midnighters","origin":"Japanese","director":"Kyohitoshi Take","cast":"Koichi Yamadera","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Afterschool_Midnighters","plot":"Three elementary school girls, Mako (Haruka Tomatsu/Caroline Combes), Miko (Sakiko Uran/Lucille Boudonnat), and Mutsuko (Minako Kotobuki/Lucille Boudonnat), decide to investigate the legends behind their school, St. Claire Elementary. As a lark they decide to vandalize the science room's human anatomy model Kunstrijk (Kouichi Yamadera/Bruno Meyere), who decides to take his own personal revenge on the three girls. He invites them to return to the school at midnight for a party, intending to scare them. Instead the three girls end up joining Kunstrijk and the skeleton model Goth (Hiromasa Taguchi/Christophe Seugnet) on a quest to gain a wish. The girls must find three medallions that are spread out over the school's enormous grounds. Kunstrijk directs them to go to three rooms: the Pool Room, the Digital Room, and the Music Room. Each room has their own guardian that fits each area's themes, as the Pool Room is guarded by a merman, the Digital Room's guardians are two all-knowing beings, and the Music Room's guardian is Mozart himself (Hiroshi Yanaka/Jean-Pierre Leblan). However the quest is made even more difficult as not everyone wants the girls to succeed and Kunstrijk is hiding his own secret reason for wanting the girls to succeed: the quest is actually to help ensure that he and Goth will remain in their living state forever rather than returning to inanimate objects."},
{"id":"9a43954d-4e8f-4f3b-b58c-c22faf08e4de","releaseYear":"2012","title":"Anata e","origin":"Japanese","director":"Yasuo Furuhata","cast":"Ken Takakura","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Anata_e","plot":"The story follows the journey of a man travelling some 300 kilometres from Toyama City, Japan to his wife's hometown in Nagasaki Prefecture, in order to scatter her ashes into the sea. Along the way he travels through many famous locations (Osaka, the ruins of Takeda Castle, Shimonoseki City, the Kanmon Bridge, Moji-ku, Kitakyūshū, and Sasebo, Nagasaki), recalling experiences with his wife along the way. He also befriends and is assisted by numerous strangers."},
{"id":"bc43554d-6c99-41f9-affa-15f1defd6b94","releaseYear":"2012","title":"Fuse Teppō Musume no Torimonochō","origin":"Japanese","director":"Masayuki Miyaji","cast":"","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Fuse_Tepp%C5%8D_Musume_no_Torimonoch%C5%8D","plot":"Hamaji is a strong and independent girl who lives alone in the mountains, surviving as a hunter just like her grandfather. One day she receives a letter from her brother Dousetsu who lives in Edo. Reaching the big city, she gets lost and ends up meeting Shino, a fuse. With her hunting skills she finds and kills a beautiful female fuse and she and her brother share in a huge reward. However she and Shino form a connection that enables him to escape from Edo and accept his situation."},
{"id":"dadd0465-934f-4a46-befe-92690a341738","releaseYear":"2012","title":"Ōoku: Emonnosuke Tsunayoshi Hen","origin":"Japanese","director":"Fuminori Kaneko","cast":"Hideaki Ito","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/%C5%8Coku:_The_Inner_Chambers","plot":"In an alternative timeline of feudal Japan, a strange disease that only affects men has caused a massive reduction of male population, thus women have to pick up men's jobs, changing the social structure. Now, after 80 years of the initial outbreak and current man:woman ratio of 1:4, Japan has become completely matriarchal, with women holding important political positions and men being their consort. Only the most powerful woman—head of Tokugawa shogunate—can keep a harem of handsome yet unproductive men, known as "},
{"id":"554249c3-b9bd-4920-b455-7a8c4e9082ff","releaseYear":"2013","title":"Wara no Tate","origin":"Japanese","director":"Takashi Miike","cast":"Tatsuya Fujiwara","genre":"thriller","wikiPage":"https://en.wikipedia.org/wiki/Wara_no_Tate","plot":"Ninagawa was a powerful man in Japanese politics and with top economic connections. His granddaughter is then murdered. The suspect is Kunihide Kiyomaru (Tatsuya Fujiwara). Three months after the murder of his granddaughter, Ninagawa places a whole page ad in the 3 big Japanese newspapers. The ad then states that if Kiyomaru was executed, Ninagawa will offer 1,000,000,000 as a reward. Kunihide Kiyomaru turns himself in at the Fukuoka Police Station. Five detectives from the security section (SP) of the Tokyo Metropolitan Police Department travel to Fukuoka to escort Kunihide Kiyomaru back to the Tokyo Metropolitan Police Department. The distance between Fukuoka and Tokyo is apprixmately 1,200 km."},
{"id":"90a73945-bcdc-44bd-88b3-711c14cfe248","releaseYear":"2013","title":"Gatchaman","origin":"Japanese","director":"Toya Sato","cast":"Tori Matsuzaka","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Gatchaman_(film)","plot":"By the year 2050 AD, a mysterious organization called Galactor has occupied half of the Earth and threatens to exterminate the human race. Around the same time, the International Science Organization had uncovered mysterious stones that bear unusual powers. It is said that one person out of approximately eight million is able to harness the power of the stones; they are known as a "},
{"id":"d15c3e57-7673-4a89-983d-3f17a74994f8","releaseYear":"2013","title":"Bayonetta: Bloody Fate","origin":"Japanese","director":"Fuminori Kizaki","cast":"","genre":"anime","wikiPage":"https://en.wikipedia.org/wiki/Bayonetta:_Bloody_Fate","plot":"As an adaption of Bayonetta rather than a direct translation, Bloody Fate's storyline follows the events and characters of the game with some slight changes to locales and specific order and details. After waking from 500 years of slumber at the bottom of a lake with no memory of her life before, the witch Bayonetta embarks on a journey to rediscover her identity and her past. Battling the hordes of angels that stand in her way, Bayonetta's journey takes her to the isolated European town of Vigrid where she is confronted by faces from her past and a mystery regarding the Eyes of the World."},
{"id":"76923d92-009a-41b2-bd4b-34bc6e5a498d","releaseYear":"2014","title":"K: Missing Kings","origin":"Japanese","director":"Shingo Suzuki","cast":"","genre":"supernatural","wikiPage":"https://en.wikipedia.org/wiki/K_(anime)","plot":"Yashiro Isana has lived a relatively ordinary, simple life. He lives in the technologically advanced Shizume City and attends Ashinaka High School, a notable high school that is located on an island just outside the areas. Yashiro is friendly with everyone. Nothing seems wrong about him, except perhaps his habit of forgetting where his school-issued PDA is. However, nothing normal has been happening since the recent murder of Tatara Totsuka, prominent member of the infamous HOMRA. No one knows who exactly killed him but the man responsible bears an uncanny, identical appearance to Yashiro. Seeking vengeance, the Red Clansmen of HOMRA set out to get Yashiro and kill him. Everyone suspects that Yashiro is the murderer."},
{"id":"dd223b71-3757-4a80-a550-6e32a4aae23c","releaseYear":"2014","title":"Little Forest Part 1","origin":"Japanese","director":"Junichi Mori","cast":"Ai Hashimoto","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Little_Forest","plot":"The manga is set in the Tōhoku region. It is about a young girl who returned to Tōhoku, her hometown, after a series of heartbreaking encounters that had happened to her life in the big city. She returned to her and her mother's old house, farming the land and living in accordance with the changing four seasons. Later, she received a letter from her mother and decided to try to "},
{"id":"4303a542-07c0-4b6f-a97b-31a01d199d6d","releaseYear":"2015","title":"Little Forest (Part 2)","origin":"Japanese","director":"Junichi Mori","cast":"Ai Hashimoto","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Little_Forest","plot":"The manga is set in the Tōhoku region. It is about a young girl who returned to Tōhoku, her hometown, after a series of heartbreaking encounters that had happened to her life in the big city. She returned to her and her mother's old house, farming the land and living in accordance with the changing four seasons. Later, she received a letter from her mother and decided to try to "},
{"id":"53373575-8cff-48a5-87c9-f95db032370b","releaseYear":"2015","title":"Tamayura: Sotsugyō Shashin Dai-1-bu -Kizashi-","origin":"Japanese","director":"Junichi Satō","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Tamayura","plot":"Tamayura centers around a young girl named Fū Sawatari who moves to Takehara, Hiroshima to begin her first year of high school. Her late father grew up in Takehara and this is her first time back in the town in five years. Fū enjoys photography and is often engrossed with taking pictures with her father's old Rollei 35 S film camera. A shy girl, Fū tries her best to make friends early on, spurred on by her childhood friend Kaoru Hanawa. She quickly becomes friends with two other girls, Maon Sakurada and Norie Okazaki. After a year has passed, Fū forms a photography club and meets fellow photographer Kanae Mitani."},
{"id":"bf578370-9c51-4e30-901b-0c172452d47a","releaseYear":"2015","title":"Koisuru Vampire","origin":"Japanese","director":"Mai Suzuki","cast":"Mirei Kiritani","genre":"vampire film","wikiPage":"https://en.wikipedia.org/wiki/Koisuru_Vampire","plot":"Kiira seems like an ordinary young girl, who likes to dress up. What differentiates her from others is that she is a vampire. She has never told anyone her secret including her first love, Tetsu. After her parents died when Kiira was 12 years old, she needed to live with her relatives and lost contact with Tetsu. But 8 years later, Tetsu appears at the bakery where Kiira works...[3]"},
{"id":"204acff9-f2cf-4a7f-b40e-f00381d79642","releaseYear":"2015","title":"Tamayura: Sotsugyō Shashin Dai-2-bu -Hibiki-","origin":"Japanese","director":"Junichi Satō","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Tamayura","plot":"Tamayura centers around a young girl named Fū Sawatari who moves to Takehara, Hiroshima to begin her first year of high school. Her late father grew up in Takehara and this is her first time back in the town in five years. Fū enjoys photography and is often engrossed with taking pictures with her father's old Rollei 35 S film camera. A shy girl, Fū tries her best to make friends early on, spurred on by her childhood friend Kaoru Hanawa. She quickly becomes friends with two other girls, Maon Sakurada and Norie Okazaki. After a year has passed, Fū forms a photography club and meets fellow photographer Kanae Mitani."},
{"id":"09dd7809-226f-444f-ad80-0d945a8001bc","releaseYear":"2015","title":"Tamayura 3","origin":"Japanese","director":"Junichi Satō","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Tamayura","plot":"Tamayura centers around a young girl named Fū Sawatari who moves to Takehara, Hiroshima to begin her first year of high school. Her late father grew up in Takehara and this is her first time back in the town in five years. Fū enjoys photography and is often engrossed with taking pictures with her father's old Rollei 35 S film camera. A shy girl, Fū tries her best to make friends early on, spurred on by her childhood friend Kaoru Hanawa. She quickly becomes friends with two other girls, Maon Sakurada and Norie Okazaki. After a year has passed, Fū forms a photography club and meets fellow photographer Kanae Mitani."},
{"id":"83528ec9-8d33-4649-aa58-d79404db36dd","releaseYear":"2007","title":"Waris Jari Hantu","origin":"Malaysian","director":"Unknown","cast":"","genre":"horror / drama","wikiPage":"https://en.wikipedia.org/wiki/Waris_Jari_Hantu","plot":"Tok Wan Rimau (Azean Irdawaty), the custodian of the spiritual tiger, is searching for a female heir to inherit her powers. Tina (Maya Karin) and Ari (Rusdi Ramli) are the relatives of Tok Wan. They are also best friends. Tok Wan's spiritual tiger protects her family and their village from harm. Tina, who is in love with Ari, nurtures her secret dream of marrying him even though the villagers often ridicule the effeminate Ari as a sissy. Deeply traumatised by these insults, Ari continues to hide behind his close relationship with Tina. Despite parental objections, Tina seems destined to be the next in line as custodian of the mystical tiger. But Ari steps in, offering himself instead."},
{"id":"870181bd-0374-432c-9be3-306e1e6e940d","releaseYear":"2008","title":"Kala Malam Bulan Mengambang","origin":"Malaysian","director":"Unknown","cast":"","genre":"horror / comedy","wikiPage":"https://en.wikipedia.org/wiki/Kala_Malam_Bulan_Mengambang","plot":"Saleh (Rosyam Nor), a reporter, finds himself stranded in a village after his car tire is punctured by a strange keris. During his stay, he meets the beautiful and mysterious Cik Putih (Umie Aida), sister to the mechanic Jongkidin, and is immediately smitten. At the same time, he also finds out that when there is a full moon, a man would disappear from the village. Rumours start to spread about a pontianak who is killing their men for their blood. Saleh decides to stay a little longer to solve the mystery, even after being advised to leave the village by Doreen (Corrien Adrienne). Who has been kidnapping the men? What is the secret of the village?"},
{"id":"0056c434-34cb-4898-b37b-2c90c11a50f1","releaseYear":"2008","title":"Cuci","origin":"Malaysian","director":"Unknown","cast":"","genre":"comedy","wikiPage":"https://en.wikipedia.org/wiki/Cuci_(film)","plot":"The story is about four brothers who are window washers from Kuala Selangor who strive for something more in their lives. They find out the existence of a Window Washing Olympics with the grand prize of a contract to wash the Petronas Towers in Kuala Lumpur. As they fight through the Olympics along with other more organised and professional teams, they realise that nothing is more important than their brotherhood and friendship."},
{"id":"6d580fda-d322-4478-b9e4-4b8125911cea","releaseYear":"2008","title":"Congkak","origin":"Malaysian","director":"Unknown","cast":"","genre":"horror","wikiPage":"https://en.wikipedia.org/wiki/Congkak_(film)","plot":"Kazman is a dedicated husband who, despite his wife Sufiah's protests, decided to buy a bungalow for their family near a lake as a family getaway. Whenever she is in the new house, Sufiah feels as if someone is watching her. At night, Sufiah and Kazman's daughter Lisa goes downstairs to play congkak with someone whom only she can see. Lisa's invisible friend compounds Sufiah's uneasiness about the new house. Sufiah throws the congkak in the lake, but is awakened the next night by the sound of the congkak being played again. Sufiah gets up to investigate the congkak sound, and sees an old lady playing it. Soon afterward, Lisa disappears, and the oldest resident in that area, Pak Tua, comes to the family's rescue and helps to locate the missing girl."},
{"id":"674a6cd8-44e0-4709-9a21-fc1223e1950f","releaseYear":"2008","title":"Tipu Kanan Tipu Kiri","origin":"Malaysian","director":"Unknown","cast":"","genre":"comedy","wikiPage":"https://en.wikipedia.org/wiki/Tipu_Kanan_Tipu_Kiri","plot":"Rudy, played by Christian Sugiono, is married to superstar celebrity Wulan, played by Titi Kamal, must keep the marriage a secret because of a clause in Wulan's contract stating that she can't get married. He then gets a job in a company (why and what company isn’t really explained) and accidentally lets it slip that he is married. When his boss (Hans Isaac) wants to meet his wife, all the trouble starts. He hires a woman (Natasha Hudson) to play his pretend wife and things slowly get out of hand."},
{"id":"efb41ee2-ddf4-4cf5-8def-1bc9b384aa79","releaseYear":"2008","title":"Kinta 1881","origin":"Malaysian","director":"Unknown","cast":"Shawn Lee","genre":"action","wikiPage":"https://en.wikipedia.org/wiki/Kinta_1881","plot":"The film is set in the Kinta Valley in the 1880s, when tin ore was discovered in the area and Chinese immigrants flooded the valley in the hope of making their fortune."},
{"id":"0b6cfa7d-5025-4e80-874c-844701e3838d","releaseYear":"2012","title":"Hantu Gangster","origin":"Malaysian","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Hantu_Gangster","plot":"In a small town located in Klang, a rogue named Te Sai (Namewee) steals a ring during a gangster's memorial ceremony, not knowing that it is haunted. The ring hosts the ghosts of three former gang leaders who begin to haunt Te Sai as he is carrying their ring. Te Sai soon finds out that the trio were killed by a traitor whose personal agenda threatens the very foundation of unity between the three gangs. Guided by the ghosts, Te Sai must now do what he can to unify the gangs and avoid a tragedy that may result in the deaths of many innocents."},
{"id":"ef5450f3-4b68-4abd-9388-745285d58f42","releaseYear":"2013","title":"Once Upon A Time","origin":"Malaysian","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Once_Upon_a_Time_(2013_film)","plot":"A sage gives Rahul a book containing various chants and spells. When Rahul reads the book, he is enchanted by a magic king and is magically transported with his doll, Kunjan, to a new world which mirrors the existence of the magic kingdom. Rahul is puzzled and decides to try to discern where he and Kunjan have been transported. During his investigations, he becomes entangled in a great conflict between the evil forces of the Black Magician and a power-hungry minister. Throughout the film, it becomes clear that Rahul must be the one to save the magic kingdom from these villains."},
{"id":"e104c63a-04c4-425c-9040-587cfc8800aa","releaseYear":"2013","title":"Sembunyi: Amukan Azazil","origin":"Malaysian","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Sembunyi:_Amukan_Azazil","plot":"Aishah is a Malay girl. During the Japanese Invasion of Malaya, she is knocked unconscious as she attempts to escape from invading Japanese soldiers. She wakes up in a strange silent town which seems to be unaffected by the invasion. The townsmen provide her with shelter, and she starts a new life. Soon she realises that there are other secrets being concealed by the town, such as a mysterious devil woods outside the town, and a demon called Azazil that preys on the villagers."},
{"id":"e2486041-2913-4371-b85b-5cbdd19fabbb","releaseYear":"2016","title":"Mayangaathey","origin":"Malaysian","director":"C. Kumaresan","cast":"C. Kumaresan / Shaila Nair","genre":"comedy / horror","wikiPage":"https://en.wikipedia.org/wiki/Mayangaathey","plot":"Aravind (C.Kumerasan) is a biker from Sabah who meets Kaaviya (Datin Sri Shaila V) and falls in love with her at first sight. After getting to know her, Aravind learns that Kavya is a single mother and all this while, her life is decided by her family. Aravind follows Kavya back to Kuala Lumpur to ask Kavya's family for her hand in marriage. Soon, everyone in the family starts to like Aravind and he too develops a special bond with Aarthi (Nilaxshita), Kavya`s daughter who suffers from a liver condition. However, what Aravind does not realise is that everything has been planned from the start and he has fallen into Kavya's cunning trap."},
{"id":"c0f93b84-0051-43fd-b3ae-d9edf0f3edf0","releaseYear":"2000","title":"His Wife's Diary","origin":"Russian","director":"Alexei Uchitel","cast":"Andrei Smirnov","genre":"historical drama","wikiPage":"https://en.wikipedia.org/wiki/His_Wife%27s_Diary","plot":"A tragic story of love and loneliness - this is the unknown life of the great Russian writer Ivan Bunin. The confused love story that involved Bunin, his wife Vera, the young poet Galina Plotnikova, opera singer Marga Kovtun and literary man Leonid Gurov. A work of great honesty and piercing psychology."},
{"id":"484d21cb-f3a3-499a-b3f5-8d07473f0b2a","releaseYear":"2002","title":"The Star","origin":"Russian","director":"Nikolai Lebedev","cast":"Igor Petrenko","genre":"war","wikiPage":"https://en.wikipedia.org/wiki/The_Star_(2002_film)","plot":"A team of Soviet scouts is sent behind enemy lines to find the location of the German armor forces. The Soviets wait until night, and open up with an artillery barrage. As the guns fire, the team advances. The team successfully slips behind enemy lines. Many dramatic scenes follow. In one, a German soldier is captured and interrogated. In another, the team calls an airstrike on German positions, causing great damage and casualties. One man even kills a German soldier with his pistol during the air attack. This tract of scenes finds the main characters successfully finding the location of the German armor. They are eventually cornered in a barn, with Germans attacking on all sides. During the battle, the team leader sends a radio message, telling the location of enemy armor. The team is eventually overrun and wiped out."},
{"id":"01f43438-a88d-42d5-a113-675f58930819","releaseYear":"2005","title":"The Sun","origin":"Russian","director":"Alexander Sokurov","cast":"Issey Ogata","genre":"historical drama","wikiPage":"https://en.wikipedia.org/wiki/The_Sun_(film)","plot":"Towards the conclusion of the Second World War, Japan nears defeat as Emperor Hirohito (Issey Ogata) reminisces on the past while being held up in a bunker underneath his Imperial Palace in Tokyo. Hirohito reflects on the foundation of the conflict while attempting to dictate peace terms. Later, U.S. military commander General Douglas MacArthur (Robert Dawson) is sent to bring him through the ruins of Tokyo for a meeting regarding the occupation of the victorious Allied leaders. The two very different men strangely bond after sharing dinner and cigars, after which Hirohito retreats to his personal quarters. Following his admission of personal failures, Hirohito attempts to rebuild his war-ravaged country as a fully developed constitutional nation while his own future remains in doubt, as either the Emperor of Japan or a war criminal."},
{"id":"3da437ea-e249-4d99-b93b-f9828ff9c1f3","releaseYear":"2007","title":"Actress","origin":"Russian","director":"Stanislav Govorukhin","cast":"","genre":"comedy","wikiPage":"https://en.wikipedia.org/wiki/Actress_(2007_film)","plot":"A no longer young divorced woman is not lucky in life. Anna is a theater actress, but is offered only minor roles. In her personal life she is lonely. Anna meets an interesting man and between them there is love. She is offered a good role and must choose between her career and love."},
{"id":"85ebbae0-153a-46e6-b11a-9b0f3b73baf7","releaseYear":"2007","title":"1612","origin":"Russian","director":"Vladimir Khotinenko","cast":"","genre":"historical fantasy","wikiPage":"https://en.wikipedia.org/wiki/1612_(film)","plot":"The film is set in Russia during the Time of Troubles, a period of civil disorder, famine and Polish invasion that followed the fall of the Rurik dynasty, which had ruled Russia in various capacities from 862 to 1598. The protagonist, Andrey, had been a servant at Tsar Boris Godunov's court while he was a boy, where he became the sole witness to the murder of the tsar's family by the order of plotting boyars. Andrey is sold to slavery. Now, seven years later, he is bought by a Spanish mercenary, Alvaro Borja, who seeks to profit over this war by fighting for the Polish invading army. The company falls prey to a band of robbers and Alvaro is killed. Andrey and his friend Kostka know that serfs without a master are considered like runaways and will be hanged. Andrey disguises himself in his dead master's clothes and assumes his name, taking the guise of a "},
{"id":"ae27a96b-4765-4b02-b749-762b08fb30a1","releaseYear":"2007","title":"Dead Daughters","origin":"Russian","director":"Pavel Ruminov","cast":"","genre":"horror","wikiPage":"https://en.wikipedia.org/wiki/Dead_Daughters","plot":"In present-day Moscow, a woman Vera (Daria Charusha[3]) is waiting in her car for a traffic light to change, when a seemingly crazy man Max (Ivan Volkov) gets into her car and demands that she drive away immediately. She agrees to take him to a restaurant, where he tells her that the ghosts of 3 sisters who were drowned by their mother have returned as ghosts which roam the city seeking vengeance. As the story continues, it seems that the sisters go after anyone who hears about their story. He tells Vera that the sisters watch their victims for 3 days, and if they do anything that the sisters find evil or bad, then they kill the person (they have psychic abilities, and can move objects, like poltergeists) Max then asks Vera if he can sleep at her house for the night. She agrees and takes him to her door, where she closes the door when he is outside, he yells at her and bangs on the door. He then runs away and is killed at what seems to be a train-yard. Vera (seemingly distressed) then calls over some of her friends Anna (Jekaterina Shcheglova), Anton (Michael Dementiev), Nikita (Nikita Emshanov), Stepan (Michael Efimov) and Rita (Ravshana Kurkova) and tells them the story. She wakes up the next morning and dies sometime through the course of the day (the viewer never finds out how she died). Her friends then meet for lunch and discuss that they must try to be as good as possible for the next 3 days. They all go about this in different ways. Anna spends her time trying to find out about the whole story, and try to stop the sisters. Rita, goes about her days normally, while being as nice to people as she can (she ends up being 'bad' in that she sells an apartment to a couple in which a mad man murdered his family, and dies by being impaled by a giant tree trunk). Stepan covers his walls in Holy Cross' and throws out all his alcohol and pornography (he at the end finds out that he gave some wrong information to one of his colleagues, by accident, he dies by being crushed by a bull somehow (the film techniques don't make his death very clear)). Nikita tells all the local district about the ghosts (as he works for a radio station, it is unclear if everyone then becomes haunted by the ghosts, it would seem not though) (he is just generally bad to random people on the street, and dies in a mysterious way, possibly from his stomach exploding). Anton tries to be nice to people, it is not certain how he is seen as evil by the sisters, possibly because he goes to a party on the last day (doing drugs etc.) he is killed by a tornado of darts all flying around him, stabbing into him into him slowly killing him. Anna eventually finds out that there is a fourth sister (Yelena Morozova), and upon visiting her, the sister says nothing other than that she has left her old life behind, Anna gives the fourth sister her number and says she is expecting her to call. The next day the fourth sister calls Anna, and gives her the dress of the daughters' mother (this is what causes them to not kill her). After her friends all die, Anna then puts on the dress of the mother, and is briefly possessed by her spirit, the spirit speaks through her telling the daughters to leave this world. The ending scene shows Anna sitting at a table (the next day), she then gets up off the table and grabs a pile of books off the table and leaves the shot, the film the abruptly ends."},
{"id":"935d130f-fd67-48e3-85fe-c1c30c7ec096","releaseYear":"2007","title":"I’m Staying","origin":"Russian","director":"Karen Oganesyan","cast":"","genre":"comedy","wikiPage":"https://en.wikipedia.org/wiki/I%E2%80%99m_Staying","plot":"Dr. Tyrsa treats people with the usual medical methods and is irritated when people want to discuss with him the otherworldly, afterlife and communication with the deceased. The only thing that really can touch his heart is the fate of his only daughter who is unrequitedly in love with her boss. It is because of her that the doctor gets in trouble: as a result of being hit on the head with a bowling ball, he falls into a coma – the state between life and death. From this moment on his views on the world change significantly. Having met other people in the other world who are also in a coma, he becomes more humane, wise and tolerant. This helps him to return to life, protect his daughter from the encroachments of a cynical suitor and help her to find true love."},
{"id":"6dbd9cdf-134f-4874-acf5-c3b005831622","releaseYear":"2007","title":"Moscow Chill","origin":"Russian","director":"Chris Solimine","cast":"","genre":"thriller","wikiPage":"https://en.wikipedia.org/wiki/Moscow_Chill","plot":"American computer hacker Ray Perso is brought to Russia. His client is a Russian oligarch sitting in jail. He orders him to track down and steal the money that is hidden in the "},
{"id":"e536dda7-dbf3-4305-84bb-0adadd72178b","releaseYear":"2008","title":"Yuri's Day","origin":"Russian","director":"Kirill Serebrennikov","cast":"Kseniya Rappoport","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Yuri%27s_Day_(2008_film)","plot":"Before leaving for a permanent residence in Germany, famous opera singer Lyuba (Kseniya Rappoport) brings her son Andryusha (Roman Shmakov) to the Russian heartland to say goodbye to her native home. For her these places represent beautiful romanticism of Russian poetry. The son goes to see the exposition of the local kremlin and disappears. Lyuba first looks for her son, and then remains in the city and waits for her son to return. Gradually she becomes a different person. Opera singer Lyubov loses her son, voice, destiny and transforms into a coarse cleaner Lucy. And in this new person additional qualities appear."},
{"id":"61a4e7d7-ae36-4afa-ae4d-21eb888eec35","releaseYear":"2010","title":"Soundtrack of Passion","origin":"Russian","director":"Nikolay Lebedev","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Soundtrack_of_Passion","plot":"The film tells the story of the pursuit of love and freedom. Vita, employee of a private detective agency, falls in love with a tall blue-eyed stranger whom she met on an island located in the center of an expansive lake in a Moscow suburb. All-consuming passion arises between them. Blinded by it, Vita does not suspect that Adam is the man whom she wiretapped for her work and that soon she will have to eliminate him.[2]"},
{"id":"826d0949-81b1-414a-8de7-c4d64335dfcb","releaseYear":"2010","title":"The Phobos","origin":"Russian","director":"Oleg Assadulin","cast":"","genre":"horror","wikiPage":"https://en.wikipedia.org/wiki/The_Phobos","plot":"On a rainy summer day a group of young people go to a club called "},
{"id":"bc6562fb-a392-4fe6-b407-031053c5d375","releaseYear":"2010","title":"Silent Souls","origin":"Russian","director":"Aleksey Fedorchenko","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Silent_Souls","plot":"Aist is a middle-aged bachelor who leads a lonely life in the northern town of Neya. Like many of his neighbours, he identifies himself as a Meryan and strives to keep alive the ancient traditions of his people. One day his boss, Miron, informs Aist of the death of his wife Tanya. Later, the pair spend quite some time washing her body and putting coloured threads in her pubic hair. (In their culture, the same ritual is performed on brides-to-be). The two men take her body to Gorbatov (the smallest town in Russia), in order to perform cremation rites on the banks of the Oka River. In the car, they carry with them two Bunting birds. On their way back to Neya, they get lost and are approached by two prostitutes, with whom they have sex. Later on, while crossing "},
{"id":"4c6e1d96-69c8-4412-b3db-88d936834c24","releaseYear":"2010","title":"What Men Talk About","origin":"Russian","director":"Dmitry Dyashchenko","cast":"","genre":"comedy","wikiPage":"https://en.wikipedia.org/wiki/What_Men_Talk_About","plot":"What Men Talk About? Of course, women. But also about work, money, cars, football ... but in general about women. And if they have two days when they escape from their offices and families, to get away from all the cares and commitments – two days, eventful and adventurous – you can be sure that this time they will have time to discuss a lot of things ... And More. From these conversations – we know for sure – many women learn about themselves a lot of new things. Four friends are going to go to Odessa for the concert of a famous Russian band ‘B-2’. Two of them, Alexey and Sasha, have problems in the morning: one can not deal with things around the house, the other – cannot get rid of the annoying customers at work. When, finally, they join their other friends who already left, Camille and Slava, they begin to talk about all sorts of things. Thus, the first day on the road passes. They spend the night in a hotel village ‘Beldyazhki’. The next day, the heroes continue to talk about life, passing through Kiev, where they buy paintings by Tishchenko and at the same time discussing modern art. By the end of the movie 4 men get into a car accident, but still make it in time for the concert. "},
{"id":"4ab7e278-eb6f-42cc-8bd4-e884898e8c70","releaseYear":"2014","title":"10","origin":"Russian","director":"Unknown","cast":"The Adventurers","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Adventurers_(2014_film)","plot":"Katya and Andrey arrive in Malta on the eve of their wedding and they coincidentally encounter Max in a diving center, a scuba diver and Katya's former fiancé. Max suggests that they all begin diving together. During one of the dives, Katya finds a fragment of a life jacket with the number of a German submarine from the time of the Second World War. After investigating, the guys find out that in 1942, members of the SS stole ancient egpyptian relics from the Maltese Order of Hospitallers, which should have been delivered to Germany. However the treasures failed to reach their destination. They decide that the drowned submarine must be somewhere around the Maltese beaches. Katya, Andrei and Max become immersed in the quest for treasure and a love triangle develops between them."},
{"id":"590f3f8a-1a0e-4dc3-a4b1-7a92ebddb5ab","releaseYear":"2016","title":"February 26","origin":"Russian","director":"Пятница","cast":"Evgeniy Shelyakin","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Friday_(2016_film)","plot":"The film shows a Friday evening in one posh Moscow nightclub, which is just celebrating the anniversary of its opening. In the club this evening the rich "},
{"id":"2de1aa4e-d7db-4a22-a28d-13c6930142ac","releaseYear":"1947","title":"Arirang","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Arirang_(1926_film)","plot":"Yeong-jin is a student who has become mentally ill after being imprisoned and tortured by the Japanese for his involvement in the March 1, 1919 protest against the Japanese occupation of Korea. After his release, he returns home to live with his father and sister, Yeong-hui, in their village home. His old friend Hyeon-gu is now in love with Yeong-hui. While the villagers are preoccupied with a harvest festival, O Gi-ho, a collaborator with the Japanese police, attempts to rape Yeong-hui. Hyeon-gu fights Gi-ho, while Yeong-jin watches and has a vision of a couple in a desert begging a man for water. When the man in his imagination embraces the woman rather than offering her water, Yeong-jin stabs him with a sickle, actually killing Gi-ho. Yeong-jin regains his senses at this moment. The film ends with the Japanese police taking Yeong-jin back to prison, while the villagers weep.[4]"},
{"id":"e7a244d7-5936-4fb8-a56c-95903c2584ff","releaseYear":"1947","title":"Nongjungjo","origin":"South_Korean","director":"Lee Gyu-seol","cast":"","genre":"melodrama","wikiPage":"https://en.wikipedia.org/wiki/Nongjungjo","plot":"The story is a melodrama concerning two lovers who are kept apart by the woman's strict parents, who lock her in her house."},
{"id":"c7f1a759-33c6-452c-981a-a9d00ac673af","releaseYear":"1947","title":"Soldier of Fortune","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"melodrama","wikiPage":"https://en.wikipedia.org/wiki/Punguna","plot":"In Punguna, Na Woon-gyu plays the role of Nicolai Park, a veteran of the Russian army, who has returned to Korea from European battlefields. Broke, hungry, and unable to find employment, he is taken in as a boarder by Kim Chang-ho. Chang-ho's friend, Cha-duk becomes romantically involved with Hae-ok, who had sold herself to support her parents. Cha-duk's wife, Yeong-ja becomes involved with Nicolai, who rejects her proposal to run away with him. The romantic complications spiral until Yeong-ja kills Cha-duk. The film ends with Nicolai departing for destinations unknown while the other boarders bid him farewell."},
{"id":"79fe1820-2d64-4aaa-8b45-c624cbc517c6","releaseYear":"1947","title":"Deuljwi","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"melodrama","wikiPage":"https://en.wikipedia.org/wiki/Deuljwi","plot":"The plot concerns a young couple who have made a marriage vow with each other. Their marriage is thwarted when the woman is forced to marry a rich gangster. A fighter for justice called "},
{"id":"1832ac42-87b5-4fa5-aa65-c3ba335c64ae","releaseYear":"1947","title":"Farewell","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Jalitgeola","plot":"This film is a melodrama telling a story of greed and lust. It begins with millionaire Min Bum-shik's wife and a steward plotting Min's murder in order to collect his money. Rapes, murder and prison sentences follow in the convoluted plot."},
{"id":"8c70553a-8195-4549-8151-bcfea81830f1","releaseYear":"1947","title":"Looking for Love","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Salangeul_chajaseo","plot":"The plot concerns three characters who have lost hope in continuing their lives in Korea—Kokosu (Lee Geum-ryong), an old man who has lost his farmland; Dong-min (Na Woon-gyu); and Jong-hui (Jeong Ok), who had been betrayed by her boyfriend. Kokosu had been a bugler in the Korean military during the last days of the Joseon Dynasty. Seeking a better life in northeast China, the three are attacked by bandits and the Japanese while attempting the ice-covered Tumen River crossing of the China–North Korea border . With his last breath, Kokosu blows the army bugle he had carried with him all his life. Dong-min takes the bugle and continues playing it."},
{"id":"cb63ac99-762c-47ae-a2be-3fb42831700b","releaseYear":"1947","title":"Deaf Sam-ryong","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Beongeoli_Sam-ryong","plot":"The plot concerns Sam-ryong, a deaf servant who is in love with his landlord's daughter-in-law. Critics praised the final scene of the film, in which the house burns, as a work of pioneering and experimental film making."},
{"id":"1a60f19c-1e5f-45f0-b000-8ff580836452","releaseYear":"1947","title":"A Story of the Day after Arirang","origin":"South_Korean","director":"Lee Gu-yeong","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Arirang_geuhu_iyagi","plot":"In this sequel to Arirang (1926), Choi Yeong-jin, the mentally ill lead character of the first film, returns home from prison to find his father and sister deep in debt. The film ends with Young-jin again being sent to prison for murder."},
{"id":"117646ee-0aad-4d77-a6f3-33cf6f54df98","releaseYear":"1947","title":"A Ferry Boat that Has No Owner","origin":"South_Korean","director":"Lee Gyu-hwan","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Imjaeobtneun_naleutbae","plot":"The plot concerns Soo-sam, a farmer who goes to Seoul and works as a rickshaw man. He is jailed for stealing money to pay for his wife's hospital bills. Upon release from jail, he learns that his wife has had an affair. Disgusted, Soo-sam returns to his village with his daughter and becomes a ferry boat operator. When a bridge is constructed 10 years later, he loses his job. After the bridge engineer tries to rape his daughter, Soo-sam dies when he is hit by a train while trying to destroy the bridge. After their house burns, killing his daughter, Soo-sam's ferry boat remains as the "},
{"id":"11b723cc-9065-4f94-9593-b0a9458c2afc","releaseYear":"1947","title":"Gaehwadang imun","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"historical","wikiPage":"https://en.wikipedia.org/wiki/Gaehwadang_imun","plot":"The film concerns the 3-day rule of Kim Ok-kyun (1851–1894), and his attempt to modernize Korea."},
{"id":"7a95301e-3da9-4fc9-b0b2-e761a60a4c60","releaseYear":"1947","title":"Jongno","origin":"South_Korean","director":"Yang Cheol","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Jongno_(film)","plot":"The film is a melodrama in which Na Woon-gyu's character breaks up with his girlfriend and becomes a vagabond. The girlfriend marries another man. When Na returns and discovers her married, he leaves again."},
{"id":"87f51f33-9ef3-414d-a6e5-838d28a387a9","releaseYear":"1947","title":"Muhwagwa","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Muhwagwa","plot":"This film is a melodrama in which Yun Bong-Choon stars as a violinist in love with a dancer played by Jeon Choon-woo. Their relationship is ruined by the interference of a rich man, played by Lee Bok-bun."},
{"id":"000cd3db-efa0-4fa4-8675-3b790654080d","releaseYear":"1947","title":"Shadow","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Geulimja","plot":"The story is a melodrama concerning a young woman, played by Yun Bong-choon, who is abused by her stepmother and half-sister. After her stepmother expels her from her home, she stabs her stepmother."},
{"id":"ae34d613-7b7d-41b3-9944-cd3611565ca3","releaseYear":"1947","title":"The Town Across the River","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Kanggeonneo_maeul","plot":"This film is a melodrama concerning a spoiled only son, played by Jeon Taek-yi. After his father scolds him for his excessive drinking, he sells the family's only cow for money to leave for Seoul. Finding life difficult on his own in Seoul, he returns to his family begging forgiveness."},
{"id":"4e6cd515-31f2-4f6b-845f-20c1e19dbbfc","releaseYear":"1947","title":"Arirang 3","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Arirang_3","plot":"This third and last installment in the story of the mentally ill student, Choi Yeong-jin, begins with him being released from prison. He attempts to live a peaceful existence until he witnesses the rape of his sister, at which point his mental problems return."},
{"id":"e459ccf1-5758-4ec0-b3a1-0b8cad9bf32d","releaseYear":"1947","title":"Oh Mong-nyeo","origin":"South_Korean","director":"Na Woon-gyu","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Oh_Mong-nyeo","plot":"This literary adaptation tells the story of Oh Mong-nyeo, a young woman living with her adopted father in a seaside village. When men in the village attempt to rape her, she escapes by boat with her boyfriend to seek a better life elsewhere."},
{"id":"d5801597-062f-4d82-a3da-a279bd7791f4","releaseYear":"1961","title":"A Flower of Evil","origin":"South_Korean","director":"Lee Yong-min","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/A_Flower_of_Evil","plot":"After many years of work, a scientist obsessed with revenge develops a flower that will do his bidding and drink human blood.[2]"},
{"id":"a4049080-9921-4170-89bc-6ba369efaba4","releaseYear":"1961","title":"The Houseguest and My Mother","origin":"South_Korean","director":"Shin Sang-ok","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Houseguest_and_My_Mother","plot":"An artist from Seoul visits the widow of a deceased friend in the countryside. The relationship between the friend's wife, her mother and the artist is depicted with reference to their concerns about social disapproval.[5]"},
{"id":"6eb5e92b-e460-4b0b-9012-693854aca4f8","releaseYear":"1965","title":"Market","origin":"South_Korean","director":"Lee Man-hee","cast":"Shin Young-kyun","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Market_(1965_film)","plot":"Bok-nyeo, a mentally handicapped woman, supports her lazy husband by selling apples at the public marketplace. When her husband abandons her for another woman, another man who sympathizes with Bok-nyeo, kills him.[4]"},
{"id":"f488e7b8-567a-4647-ab08-613cdb55e337","releaseYear":"1969","title":"Assassin","origin":"South_Korean","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Assassin_(1969_film)","plot":"A man is given a task to kill Hwang To-jin, a North Korean spy who turned himself in to South, and penetrates into the South. He meets Hwang To-jin’s daughter and comes to feel skeptical of his behavior. Then he receives an order to hurry the assassination. He finally realizes that he has been foolish and turns himself to the police to help round up the spy network.[1]"},
{"id":"f7f5d29d-ea29-4d05-9ea7-c76e6e53c6f1","releaseYear":"1969","title":"Lady Hong","origin":"South_Korean","director":"Kim Ki-young","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Lady_Hong","plot":"A man whose fiancee and her family have died, reluctantly marries another woman. When the ghost of his fiancee visits him, he is tempted to join her in matrimony.[2]"},
{"id":"41134791-2a0f-417a-800c-95f6f915eafe","releaseYear":"1969","title":"The Old Jar Craftsman","origin":"South_Korean","director":"Choi Ha-won","cast":"Hwang Hae","genre":"literary drama","wikiPage":"https://en.wikipedia.org/wiki/The_Old_Jar_Craftsman","plot":"A lonely old man who makes a living as a potter saves the life of a young woman. The two marry and have a son. The woman's old lover finds her, and she runs away with him. The old potter commits suicide. Years later, the woman, now a beggar, returns to her old home and visits her son at the old potter's grave. Based on a novel.[5]"},
{"id":"8d37bb0b-a861-4e62-b82d-af268cb047d9","releaseYear":"1970","title":"Pilnyeo","origin":"South_Korean","director":"Jung So-young","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Pilnyeo","plot":"Twice widowed, Pilnyeo vows never to marry again and takes a job at a coal mine. One day she is raped by her supervisor, but later marries him. Pilnyeo continues to be abused by her new husband, but later risks her own life for him."},
{"id":"e7201bed-5eea-4f79-9196-e7e20707cbed","releaseYear":"1971","title":"Bun-Rye's Story","origin":"South_Korean","director":"Yu Hyun-mok","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Bun-Rye%27s_Story","plot":"Bun-rye, the eldest daughter in a poor family, is violated by Yong-pal, who is a married man, and out of desperation she becomes a concubine of Young-cheol, a gambler who is impotent. Kong Jo-shi is in love with Bun-rye, though she still has feelings for Yong-pal. After losing his money, Young-cheol takes out his anger on Bun-rye and throws her out of his house. In retaliation, Jo-shi kills Young-cheol, and Bun-rye is driven to madness."},
{"id":"9a3ec196-f020-4aeb-ba99-ce77e2f1bcd8","releaseYear":"1973","title":"A Resentful Woman","origin":"South_Korean","director":"Lee Yu-seob","cast":"Shin Yeong-il","genre":"horror","wikiPage":"https://en.wikipedia.org/wiki/A_Resentful_Woman","plot":"The spirit of Bo-yeong is unable to ascend to the next world due to her unmarried status. The woman's nanny's spirit tries to help Bo-yeong by arranging a soul-marriage with a villager named Jeong. Jeong's father has been unjustly imprisoned by the dishonest village chief who covets the family's fortune. The nanny's spirit helps Jeong to pass the Bar examination, so that he can save his father. By now in love with Jeong, Bo-yeong and her nanny's spirit pass into heaven.[1]"},
{"id":"ef2d562c-655b-4a69-a92d-e02cfc134959","releaseYear":"1978","title":"Killer Butterfly","origin":"South_Korean","director":"Kim Ki-young","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Killer_Butterfly","plot":"A melodrama about a man who survives an attempted double suicide with a stranger while picnicing with friends. He goes on a cave expedition for a famous archaeologist where he discovers a skeleton several thousand years old. He meets the spirit of the skeleton in a dream, and then becomes romantically involved with the archeologist's daughter.[2]"},
{"id":"60bae696-befd-4ae9-9509-7819cc615c35","releaseYear":"1979","title":"The Rain at Night","origin":"South_Korean","director":"Park Chul-soo","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Rain_at_Night","plot":"Ga-hi, a kindergarten teacher, is raped one night while on her way to meet her boyfriend, Young-woo. She later recognises her attacker as Hwang Sa-bin, a boxer, and after seeing him lose a fight begins to develop feelings towards him."},
{"id":"94828b3e-5d1d-414a-a825-cdaa00662b5a","releaseYear":"1984","title":"Madame Aema 2","origin":"South_Korean","director":"Jeong In-yeop","cast":"Oh Su-bi","genre":"ero","wikiPage":"https://en.wikipedia.org/wiki/Madame_Aema_2","plot":"Aema and her husband, from Madame Aema (1982) have now divorced. While on vacation on Jeju Island, Aema contemplates her current love affairs, and returning to her husband, who is now living with another woman. Resolving to become independent, Aema declares that love and marriage are separate things.[1]"},
{"id":"70d91c3f-058a-4893-ae50-bcbe6ddd6397","releaseYear":"1984","title":"Mulleya Mulleya","origin":"South_Korean","director":"Lee Doo-yong","cast":"Won Mi-kyung","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Mulleya_Mulleya","plot":"A historical drama about the life of a widow. 15th century life was sometimes cruel to Korean women and this story depicts a lot of the injustices that could occur as happening to Kil-Rye, the heroine.[8]"},
{"id":"dd71de4d-924e-40cd-bf36-42807957cec2","releaseYear":"1985","title":"Madame Aema 3","origin":"South_Korean","director":"Jeong In-yeop","cast":"Kim Bu-seon","genre":"ero","wikiPage":"https://en.wikipedia.org/wiki/Madame_Aema_3","plot":"Aema is married to a Professor Noh in this entry in the Aema Buin series. Professor Noh has become obsessed with sex through his research and wild experiences abroad. Consequently, he is dissatisfied with Aema. Aema has an affair with a professional wrestler who resembles her first boyfriend, then seeks forgiveness from her husband. When their reconciliation proves a failure, Aema wanders the streets in despair.[1]"},
{"id":"859af0db-e261-4022-ae20-47230ccdacc4","releaseYear":"1985","title":"Mother","origin":"South_Korean","director":"Park Chul-soo","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Mother_(1985_film)","plot":"After the rape and subsequent suicide of a college student, her mother takes revenge on those responsible."},
{"id":"6acda7bd-e410-4cf1-a6b6-d3a8cc188981","releaseYear":"1986","title":"Gilsoddeum","origin":"South_Korean","director":"Im Kwon-taek","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Gilsoddeum","plot":"In 1983 KBS launched a campaign to reunite families torn apart in the Korean War three decades earlier. In an expert dissection of the social and familial rifts in modern Korea, director Im Kwon-taek integrates footage from the campaign into the story of Hwa-yeong, who leaves her middle-class life in Busan to search for the son she lost in Gilsotteum during the war.[3]"},
{"id":"e3046c1e-a8a1-474f-87f8-7b349c27d1d1","releaseYear":"1987","title":"The Surrogate Woman","origin":"South_Korean","director":"Im Kwon-taek","cast":"Kang Soo-yeon","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Surrogate_Woman","plot":"Shin, a nobleman, has been trying to conceive a male heir to continue his family name. Unable to provide a male heir, Shin's wife gives her husband permission to search for a surrogate wife to bear a male heir. On the way to finding a surrogate wife, Shin runs into a 17-year-old girl, Ok-nyo (Kang Soo-yeon). She is a poor, but feisty, girl who states that she will do anything for money. The stubborn nature of Ok-nyo attracts Shin and influences him to choose her to become the mother of his child. Ok-nyo holds the social status of a servant, but the relationship changes both of them through the course of the movie. Ok-nyo has to obey rules which keep her hidden during the day and delegates her to perform the mating ritual during Shins wife's hours of choosing. No matter what is happening, Ok-nyo can not leave the building in which she is housed. With Shin's infatuation and Ok-nyo's attachment, both secretly meet for passionate affairs. Unfortunately both eventually get caught, which causes their separation. Ok-nyo's mother tries to dissuade her, and to break off the relationship, by telling her the realities of life. Even though both are punished for the infraction, they still continue to meet. Eventually Ok-nyo conceives an heir for Shin, but is burdened with not knowing whether Shin will stay by her side or leave with her child forever."},
{"id":"34597471-0af9-4dfc-b7b8-9bcb50bc1517","releaseYear":"1988","title":"Sa Bangji","origin":"South_Korean","director":"Song Kyung-shik","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Sa_Bangji_(film)","plot":"Sa Bangji is a hermaphrodite, born to a hardened criminal and mentally disturbed woman. Taken in at a monastery, Sa Bang-ji meets and falls in love with a grieving young widow, Lee So-sa, but she betrays him when their relationship is discovered by the elders in her family. Sa Bang-ji manages to escape and meets a shaman priestess named Myo-hwa, with whom he plots to take revenge. After Myo-hwa is killed, Sa Bang-ji and So-sa are reunited, but they Sa Bang-Ji is captured and killed, and So-sa commits suicide."},
{"id":"b4df4e9f-3e72-44a3-949a-2763b1a7cb22","releaseYear":"1988","title":"You My Rose Mellow","origin":"South_Korean","director":"Park Chul-soo","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/You_My_Rose_Mellow","plot":"Jong-hwan and Su-kyung meet in a cafe. Jong-hwan is a high-school teacher and Su-kyung is a cafe maid. They fall in love and marry; however, when Jong-hwan goes to take care of his family, Su-kyung gets ill, forcing him to care for her."},
{"id":"2f2860d1-ce62-46e2-84f7-8eaeaf03615d","releaseYear":"1990","title":"Madame Aema 4","origin":"South_Korean","director":"Suk Do-won","cast":"Ju Ri-hye","genre":"ero","wikiPage":"https://en.wikipedia.org/wiki/Madame_Aema_4","plot":"In this entry in the long-running Madame Aema series, Aema's husband becomes romantically involved with a Japanese woman after taking a job at a Japanese company. Aema must also contend with two men who are making romantic advances towards her.[1]"},
{"id":"9f53bc48-e73e-4881-b44d-256fb756ae33","releaseYear":"1992","title":"Madame Aema 6","origin":"South_Korean","director":"Suk Do-won","cast":"Da Hui-a","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Madame_Aema_6","plot":"In this entry in the long-running Madame Aema series, three Aemas are represented: a fourth, a fifth, and a sixth generation of women bearing the name Madame Aema. The fourth generation Aema lives on Jeju Island with her daughter and memories of unrequited love. The fifth generation tries to console the fourth generation Aema, while dealing with her own issues of isolation after declaring herself an independent woman. Sixth generation Aema is undergoing marital difficulties with an unfaithful husband whom she eventually divorces.[3]"},
{"id":"f2299938-7e10-47c5-a36b-143d74b819ff","releaseYear":"1992","title":"Madame Aema 7","origin":"South_Korean","director":"Suk Do-won","cast":"Kang Seung-mi","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Madame_Aema_7","plot":"In this episode in the long-running Madame Aema series, Aema leaves her selfish, middle-aged husband to pursue a career as an actress. She meets a performance artist who persuades her to perform perverted sex acts in the name of art. Finally, repenting of her decision, she returns to her husband.[1]"},
{"id":"8b48d429-cc2d-4073-b6d4-5e575c03c019","releaseYear":"1993","title":"Hwa-Om-Kyung","origin":"South_Korean","director":"Jang Sun-woo","cast":"Oh Tae-kyung","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Hwa-Om-Kyung","plot":"The film presents a Buddhist-themed story of a boy searching for his mother who abandoned him as a baby, and the characters he meets on his journey.[2]"},
{"id":"7cf8e6db-d660-4944-ac3e-be9a4a3072bf","releaseYear":"1993","title":"I Will Survive","origin":"South_Korean","director":"Yoon Sam-yook","cast":"Lee Deok-hwa","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/I_Will_Survive_(film)","plot":"Man-seok is an executioner from the butcher caste and therefore discriminated against. One day, he receives a request from a noble family that one of their condemned be executed without his head being cut off. Man-seok does as instructed, but when his payment is delivered by Sug-young, the daughter of the executed, he rapes her, motivated by his deep resentment against the ruling elite. Later, she is arrested and sold into slavery. Feeling guilty, Man-seok buys her freedom, and the two eventually fall in love and settle down to a peaceful married life. However, their happiness is threatened when they are involved in a conspiracy against the enemies of Sug-young's family."},
{"id":"a174499a-1f15-4a7a-99f0-a5c9d4852084","releaseYear":"1993","title":"Madame Aema 9","origin":"South_Korean","director":"Kim Sung-su","cast":"Jin Ju-hui","genre":"ero","wikiPage":"https://en.wikipedia.org/wiki/Madame_Aema_9","plot":"Aema is a bored housewife married to a successful, workaholic businessman. She begins an affair with Jean, a business associate of her husband's. Her husband suspects and begins tormenting Aema, while not letting on that he knows, to protect a business deal. Aema leaves her husband, but is persuaded to return after heeding advice from a friend.[1]"},
{"id":"5aac30f7-9a4e-4016-b02d-3c2755c3dadc","releaseYear":"1993","title":"Sopyonje","origin":"South_Korean","director":"Im Kwon-taek","cast":"Oh Jung-hae","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Sopyonje","plot":"In a jumak (a tavern) on a small pass called Soritjae of Boseong County, South Jeolla Province,[2] during the early 1960s, Dong-ho who is in his 30s, recalls his past as he is listening to a rendition of "},
{"id":"320b9d8f-ff3c-477c-aa24-2d9921dcd2d2","releaseYear":"1993","title":"Two Cops","origin":"South_Korean","director":"Kang Woo-suk","cast":"Ahn Sung-ki","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Two_Cops","plot":"The experienced detective Jo has a new partner, Kang who recently graduated from the Police Academy at the top of the class. The idealistic Kang always sticks to his principles and often conflicts with Jo, an amoral cop who always tries to take advantage of his position. Kang tries to win Jo over to his side, but fails. One day, a beautiful woman who works in a bar comes to the police station for help, and Kang falls in love with her. He starts going to the bar often to see her, and begins to become more like Jo. Jo is initially pleased at this, but later begins to experience a dilemma with Kang's change in attitude."},
{"id":"1c3a05cf-eca5-4153-bdfb-b07fcba1df08","releaseYear":"1994","title":"The Fox with Nine Tails","origin":"South_Korean","director":"Park Heon-soo","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Fox_with_Nine_Tails","plot":"Harah is a kumiho in the guise of a beautiful young woman, who desperately desires to become human. She falls in love with a charming taxi driver, Hyuk, and tries to use him to achieve her goal. But an agent from hell has been sent to track down and destroy her."},
{"id":"394d0016-d9be-4284-88ce-83dbfa245cbc","releaseYear":"1994","title":"Madame Aema 10","origin":"South_Korean","director":"Suk Do-won","cast":"O No-a","genre":"ero","wikiPage":"https://en.wikipedia.org/wiki/Madame_Aema_10","plot":"This time in the Madame Aema series, Aema leaves her husband, tired of his demanding ways. She moves to Jeju Island and lives with her friend, Young-ju. She begins having an affair with a member of a Samul nori group. Shocked by Young-ju's lesbian advances, and persuaded by her boyfriend, Aema returns to her husband.[1]"},
{"id":"b95977ef-9f76-4192-8447-214ac726b4d4","releaseYear":"1994","title":"The Taebaek Mountains","origin":"South_Korean","director":"Im Kwon-taek","cast":"Ahn Sung-ki","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Taebaek_Mountains","plot":"The film originates from the great river story Taebaegsanmaek consisting of 10 volumes and is written by Cho Jeongrae. The story tries to describe and reveal a few generations-lasting conflicts between the haves (proprietors) and have-nots (peasants), which develop into right wings and left wings respectively. While revealing why and how the conflicts come about, the story depicts every corner of real life—romantic, shamanic, and Confucian aspects of the contemporaries. It provides a further insight into the politically controversial ideological issue on which the viewpoint is virtually hardened among over 40's in South Korea. This ideological issue survives even in the digital age to have a substantial effect on presidential elections. The author dares to show what the ideological conflict derives from and tries to describe it in detail and with artistic skill of commanding Korean colloquial language supplying its readers the true taste of Korean dialect expressions especially in its southern part Jeolla province."},
{"id":"8e49dec4-ffe6-465a-8843-37cca4183c83","releaseYear":"1995","title":"Madame Aema 11","origin":"South_Korean","director":"Joe Moung-hwa","cast":"Lee Da-yeon","genre":"ero","wikiPage":"https://en.wikipedia.org/wiki/Madame_Aema_11","plot":"In this episode in the Madame Aema series, Aema is married to a respected scholar who is preoccupied with his research and unable to satisfy her sex drive. Aema's husband becomes the target of a Japanese businessman with ties to the yakuza. Seeking to take his research, the Japanese businessman blackmail Aema's husband by taping him in a compromising position with a young woman he has sent to seduce him. Meanwhile, Aema is indulging in an affairs of her own.[1]"},
{"id":"d5d67e15-fe75-4982-9ff4-3474f134b6c2","releaseYear":"1995","title":"Runaway","origin":"South_Korean","director":"Kim Sung-su","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Runaway_(1995_film)","plot":"Lee Dong-ho, a game show producer, and Choi Miran, a freelance illustrator meet by chance and spend a short but passionate night together. But just when they are about to go back to their ordinary lives, they witness a shocking murder. This is followed by mysterious happenings that destroy everything that they cherish in their lives. A police officer turns out to be a kidnapper and hired killers break into their homes. In front of their eyes, they lose their loved ones. Nobody is of much help to them. At home, in the police station, in the hospital, at work, wherever they go, criminals seem to follow them. Finally, they must face the real criminals."},
{"id":"e07fa592-06e2-4fa5-964d-d0fb60cee755","releaseYear":"1995","title":"A Single Spark","origin":"South_Korean","director":"Park Kwang-su","cast":"Hong Kyung-in","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/A_Single_Spark","plot":"A biographical film about Jeon Tae-il, a worker who protested labor conditions through self-immolation.[2]"},
{"id":"71d8ed4f-ad67-4171-b2ec-3202154ff8f7","releaseYear":"1995","title":"Who Drives Me Crazy","origin":"South_Korean","director":"Koo Im-seo","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Who_Drives_Me_Crazy","plot":"Kim Jong-du, a salesman who believes that luck will change when he becomes a famous writer. However he is forced to give up after his story failed to win at a spring literature contest. Added to this is the fear that his girlfriend Joo-young will leave him. After Joo-young gets a job Jong-du realizes his mistakes that knows that she will never leave him."},
{"id":"1dd9c206-35e6-41cb-b054-50a36c79a78a","releaseYear":"1996","title":"Born to Kill","origin":"South_Korean","director":"Jang Hyun-su","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Born_to_Kill_(1996_film)","plot":"The life of a professional killer becomes complicated when he falls in love with his neighbor, Soo-ha, a bargirl."},
{"id":"0d93b20f-2c63-4f9b-a351-5923b10c681e","releaseYear":"1996","title":"Kill the Love","origin":"South_Korean","director":"Im Jong-jae","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Kill_the_Love","plot":"When Love, the protagonist, joins the Korean Underworld in United States, he falls in love with a nightclub dancer. As a result, his friend wants to kill him."},
{"id":"4bca75e8-0bac-4653-abe9-99732b65aeb7","releaseYear":"1996","title":"A Petal","origin":"South_Korean","director":"Jang Sun-woo","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/A_Petal_(1996_film)","plot":"The film tells the story of a girl who experienced the Gwangju uprising at the age of 15, and its effect on her life in later years.[4]"},
{"id":"ecd324e4-38ad-456f-918d-7088a7e453af","releaseYear":"1997","title":"Beat","origin":"South_Korean","director":"Kim Sung-su","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Beat_(1997_film)","plot":"Three friends in Korea all drop out of high school. Min is a feared brawler whose widowed mother is a drunk. The story traces his journey from high school to the underworld as his best friend introduces him to life in the mob. Complicating Min's life further is his love for the volatile Romy, a girl from an upper-class family with dreams of going to a prestigious college."},
{"id":"64216b45-ad3e-41ce-92d6-4192ce2f1347","releaseYear":"1997","title":"The Hole","origin":"South_Korean","director":"Kim Sung-hong","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Hole_(1997_film)","plot":"Jin-sook has a close relationship with her son, Don-woo, and is surprised when he announces his engagement to Su-jin. After the wedding, the three end up living together, with a nervous Su-jin keen to impress her new mother-in-law. But Jin-sook is determined to sabotage her son's marriage."},
{"id":"58fc1231-0acd-432e-a951-1f4d64b4f4c9","releaseYear":"1997","title":"PpilKu","origin":"South_Korean","director":"Yu Jin-seon","cast":"Lee Min-woo","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/PpilKu","plot":"Pil-gu is a high school athlete and the leader of an underground club called Shock. Along with the Shocks, the judo club and a girls' club called Sexy Wave led by Hee-jeong cause plenty of trouble and mayhem in the school. The arrival of a pretty young teacher named Yoo Yuna gets the students in gear for another big scheme. Each club sets up a strategy to lure the new teacher. After beating numerous contenders, Pil-gu approaches Yuna."},
{"id":"144a2f6f-3edb-4bda-a550-ed2b001dad81","releaseYear":"1997","title":"Push! Push!","origin":"South_Korean","director":"Park Chul-soo","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Push!_Push!","plot":"There are two female doctors in an obstetrics and gynecology clinic. Jung-yeon is fed up with delivering and aborting babies all day long. Hae-seok treats various gynecological diseases. They are very close friends. Jung-yeon, who is married, puts more emphasis on being a rational woman than being a mother. On the other hand, the single Hae-seok thinks the opposite. With their own two distinct styles, they handle various cases at the clinic. One day, an unbelievable situation happens when the two doctors, a woman, her husband, and her mother-in-law all become excited about the successful birth of test-tube twins..."},
{"id":"54ebfcb2-9347-4e40-955c-8ddd904ece0f","releaseYear":"1999","title":"Harmonium in My Memory","origin":"South_Korean","director":"Lee Young-jae","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Harmonium_in_My_Memory","plot":"In 1962, South Korea. Kang Soo-ha, a 21-year-old teacher from Seoul, takes his first job at a village school in Gangwon Province. One of his older students, 17-year-old Yun Hong-yeon, develops a crush on him, though her efforts to catch his attention seem to go unnoticed. Meanwhile, Soo-ha has fallen for Yang Eun-hee, a fellow teacher at their school."},
{"id":"671163dd-f45e-4fda-9f08-51dc74b26056","releaseYear":"2009","title":"City of Damnation","origin":"South_Korean","director":"Unknown","cast":"Kim Dong-weon","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/City_of_Damnation","plot":"Jang Choon-dong is a traffic officer who aspires to become a homicide detective. After being noticed by his superiors, Choon-dong is assigned to go undercover to infiltrate a gangster network headed by Yang Kwang-seob. Meanwhile, Lee Joong-dae (Jung Woong-in), a member of Kwang-seob's gang, goes undercover himself by joining the police force. Joong-dae tries hard to gain favour with his squad leader and bureau director in an effort to expose Choon-dong's identity, but falls in love with a colleague, Cha Se-rin."},
{"id":"a3e89f02-0b6c-41a7-94fa-70e8c73eab46","releaseYear":"2009","title":"Naked Kitchen !The Naked Kitchen","origin":"South_Korean","director":"Unknown","cast":"Hong Ji-young","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Naked_Kitchen","plot":"Ahn Mo-rae and Han Sang-in have been friends since childhood. He didn't mind that she followed him around, calling him hyeong or Big Brother (though Korean girls are supposed to call older guys oppa), and their marital relationship is an odd but appealing mix of hot sex and best buddies. The day of their wedding anniversary is pretty eventful. Mo-rae (Shin Min-ah) cooks breakfast, serving it on their best china, hoping to get Sang-in (Kim Tae-woo) into the mood for love before he goes to work. Sang-in quits his high-end stockbroker job so that he can devote himself to his lifelong dream of running a fancy restaurant. While shopping for an anniversary gift for Sang-in, Mo-rae sneaks into a closed gallery, where she encounters another illicit visitor—a very handsome young man with whom she hides when the gallery owner turns up. Mo-rae, overcome by heat and dizziness, has a sudden sexual encounter with the stranger, who then vanishes. She confesses the incident to her husband, downplaying it both to him and to herself. Then Sang-in tells Mo-rae over dinner that he's expecting a mentor to help him plan the menu for his dream restaurant: a brilliant young French-Korean chef who will arrive that evening. Park Du-re (Ju Ji-hoon),French-Korean mentor, turns out to be Mo-rae's stranger, who now will be staying with the young couple, sleeping in the room that had belonged to Sang-in's late mother. With her husband blissfully unaware of Du-re’s identity, he encourages Mo-rae to get along with him. Mo-rae is powerfully drawn to Du-re while Sang-in gets cooking lessons from him, leading the poor woman to somewhat of a crisis as she tries to decide what her heart really wants.But at the end Mo-rea eventually decides to leave them both. [4][5][6]"},
{"id":"0e9da4a8-deec-478d-bcca-55d4c18b4a92","releaseYear":"2009","title":"Handphone","origin":"South_Korean","director":"Unknown","cast":"Kim Han-min","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Handphone_(film)","plot":"Talent manager Seung-min sees Yoon Jin-ah, a rising actress, as his one last hope to turn his life around. Just as Jin-ah is on the path to stardom, he receives a threat from her former lover and gets her sex clip on his phone. Seung-min tracks down the culprit and retrieves the tape but ends up losing his phone. He realizes there is one last evidence of the sex tape on his phone and anxiously looks for it. Yi-gyu, who found Seung-min's phone, calls Seung-min's wife and asks her to come pick it up. On the night the phone was supposed to be returned, Yi-gyu doesn't show up. Now Yi-gyu is the one holding the leverage. Seung-min tries to do everything possible to get back his phone but Yi-gyu's demands are escalating to the point of no return.[4][5]"},
{"id":"14fc16ee-d440-42c3-a002-fd34f287c513","releaseYear":"2009","title":"Private Eye","origin":"South_Korean","director":"Unknown","cast":"Park Dae-min","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Private_Eye_(film)","plot":"Seoul, 1910. Hong Jin-ho, Joseon’s first detective, travels around solving trivial family disputes for pocket money as a private detective. However, he is determined to go to America someday and is saving up for the trip. Then one night, Gwang-soo, a medical physician in training, discovers a corpse in the woods and secretly takes it to practice dissecting. But the corpse turns out to be the son of Seoul’s most powerful man. While planning to flee in the middle of the night and afraid of murder accusations, Gwang-soo meets Jin-ho, and asks him to find the killer. When another corpse turns up in the woods, murdered in the same way as the first victim, Jin-ho and Gwang-soo use a piece of cloth they find in the victim’s mouth as the lead they need to bring them one step closer to the real killer."},
{"id":"d68d3f17-328e-40aa-be88-4e3093096c1d","releaseYear":"2009","title":"Insadong Scandal","origin":"South_Korean","director":"Unknown","cast":"Park Hee-gon","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Insadong_Scandal","plot":"A fabled painting from a royal palace is discovered after 400 years. Once properly restored, it could fetch at least $40 million in the international auction market. Bae is the owner of the gallery which possesses the painting. She commissions Lee, a restoration artist, to unveil the painting's true form and purpose."},
{"id":"dae0dde4-dd29-4596-9061-ad651d0cb485","releaseYear":"2009","title":"Boat","origin":"South_Korean","director":"Unknown","cast":"Kim Young-nam","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Boat_(2009_film)","plot":"Hyung-gu, a young smuggler, was raised by his boss Bo-kyeong after his mother left him when he was six years old. Hyung-gu's boss asks him to work with a Japanese man named Toru; Toru needs the money to support his younger sister. Hyung-gu and Toru are forced to live on Hyung-gu's boat and kidnap a Korean woman named Ji-su, which leads to trouble."},
{"id":"88965753-2f9e-417b-8274-1df40bbfe358","releaseYear":"2009","title":"Chaw","origin":"South_Korean","director":"Unknown","cast":"Sin Jeong-won","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Chaw_(film)","plot":"The quiet town of Sammaeri near Mount Jiri has been crime-free for a decade until now. Bodies of villagers begin turning up, making the village leaders nervous just ahead of an organic food fair expected to be a financial windfall. Chun Il-man (Jang Hang-sun), whose granddaughter was one of the victims, is sure that a man-killing boar is behind the crimes. He joins forces with detective Shin (Park Hyuk-kwon) and Kim Kang-soo (Uhm Tae-woong), a reassigned cop from Seoul whose mother has gone missing in the woods. With Byun Soo-ryun (Jung Yu-mi), a biologist studying wild animals, and glory-seeking hunter Baek Man-bae (Yoon Je-moon) on the team to fight the giant killer beast, the five start up the mountain to face their enemy.[4][5][6][7][8]"},
{"id":"0d1bc120-0ac4-44ed-b31d-711924d17228","releaseYear":"2009","title":"Take off","origin":"South_Korean","director":"Unknown","cast":"Kim Yong-hwa","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Take_Off_(2009_film)","plot":"Cha Heon-tae, a Korean-born American, was adopted with his sister to American parents. He appears on a Korean television program in search of his mother. Since Heon-tae is a trained alpine skier, he is approached by Coach Bang who wants to recruit members for a new national ski jumping team for the approaching 1998 Winter Olympics. The other members are Choi Hong-cheol, a night club waiter; Ma Jae-bok, who works at a meat restaurant and has a strict father; and Kang Chil-gu, who lives with his grandmother and autistic brother Bong-gu. All are good skiers, but are out of practice. To gear up for the qualifying match at the World Cup, they overcome their fear and train in unusual places, such as from the top of cars, amusement park roller coasters, etc. After almost getting disqualified because of a fight the night before, they succeed in qualifying at the World Cup. But the victory is bittersweet once they hear the IOC opted for Salt Lake City over Korea's Muju County. Unfortunately, because of deep fog, Chil-gu injures his leg and becomes unable to compete. Bong-gu decides to jump as a substitute but does not make the required distance for a gold medal and nearly loses his life. Despite their loss, the athletes rejoice because Bong-gu survived the jump, and the Koreans back home are proud of them."},
{"id":"98047814-0dc5-4e4f-b72f-883b3c410a9f","releaseYear":"2009","title":"4th Period Mystery","origin":"South_Korean","director":"Unknown","cast":"Lee Sang-yong","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/4th_Period_Mystery","plot":"Jung-hoon (Yoo Seung-ho) is the best student at his school. His rival, Tae-gyu (Jo Sang-geun), takes any and every opportunity to knock him down both verbally and physically, and the two are known enemies amongst the other students. One afternoon Tae-gyu pushes Jung-hoon too far and the latter threatens Tae-gyu with a knife, an act that's witnessed by another student. Jung-hoon walks away from the situation, but shortly after the beginning of 4th period class he returns to find Tae-gyu dead. The boy has been stabbed repeatedly, and still in shock, Jung-hoon picks up the bloody knife off a nearby desk just as Da-jung (Kang So-ra) shows up, catching him in a most incriminating position. Fortunately for him, she not only believes his innocence, but offers to help him to solve the mystery and catch the real killer – a task made particularly urgent by the fact that in 40 minutes the rest of the class will return and the body will be discovered. The pair set out in search of the murderer and soon discover that just about everyone’s a suspect and even more unsettling, the murderer is now after them as well."},
{"id":"34e3c1f5-05f0-4a27-b058-8e74ebca1aad","releaseYear":"2009","title":"Possessed","origin":"South_Korean","director":"Unknown","cast":"Lee Yong-ju","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Living_Death_(film)","plot":"A college student named Hee-jin (Nam Sang-mi) returns home when her 14-year-old sister So-jin (Shim Eun-kyung) goes missing. Her mother (Kim Bo-yeon), a fanatic churchgoer, resorts to prayer and refuses to work with the lazy police to find So-jin. Meanwhile, a neighbor commits suicide and leaves a will for So-jin, and Hee-jin hears rumors that her sister had been possessed. The whereabouts of So-jin become increasingly elusive and the dead neighbor begins appearing in Hee-jin's dreams."},
{"id":"79d02bd6-8cb6-4791-ba22-e6b1f87956c9","releaseYear":"2009","title":"Closer to Heaven","origin":"South_Korean","director":"Unknown","cast":"Park Jin-pyo","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Closer_to_Heaven_(film)","plot":"Lee Ji-soo is a twice-divorced funeral director, and no stranger to death or loss. She reunites with old friend Baek Jong-woo when he arranges for funeral services for his deceased mother. Jong-woo has been battling Lou Gehrig's disease since he was a teenager. The two fall in love and get married. As Jong-woo's symptoms continue to worsen and he begins to lose control over his body, he lashes out at Ji-soo. Despite her hurt, all Ji-soo wants is to stay by his side and hope for a cure."},
{"id":"59e00ab8-1426-4db9-a0a1-ad3aead2c61e","releaseYear":"2009","title":"A Good Rain Knows","origin":"South_Korean","director":"Unknown","cast":"Hur Jin-ho","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/A_Season_of_Good_Rain","plot":"Timely like the spring rain, so has he come back into my life ... . Dong-ha is a thirty-something Korean architect on a business trip to Chengdu, China where his company is carrying out construction projects to rebuild the city after the earthquake of 2008. By chance, he meets May, an old friend from his school days in the U.S. May is originally from Chengdu, where she had returned to after graduation; she works as a tour guide. Dong-ha and May had feelings for each other then, but they parted before they had a chance to define or declare them. Now that they are thrown together again, they find that these old feelings reignite and new ones form.[16][17][18][19][20]"},
{"id":"c79f4add-6a4f-4ba6-be3b-a415cd1e0665","releaseYear":"2009","title":"Brand New Life !A Brand New Life","origin":"South_Korean","director":"Unknown","cast":"Ounie Lecomte","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/A_Brand_New_Life_(2009_film)","plot":"Jin-hee (Kim Sae-ron) is a 9-year-old girl whose father leaves her at an orphanage after remarrying. Before leaving her at the orphanage, her father buys her new clothes and a cake to convince her that she is going on a trip. (This coincides with the Korean title, which literally means "},
{"id":"50ed5a47-df17-441f-b5b7-955e63b02650","releaseYear":"2009","title":"19-Nineteen","origin":"South_Korean","director":"Unknown","cast":"Jang Yong-woo","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/19-Nineteen","plot":"After graduating from high school Min-seo (Seungri) fails to get into college. He spends the next year cramming for his entrance exam once again. Jung-hoon (T.O.P) is a university student fresh out of high school. Late one evening, a high school girl dies. Earlier that evening, Min-seo filmed the girl in an internet cafe without her knowing. Min-seo, Jung-hoon, and another girl named Eun-young (Huh E-jae) – who went to the same high school as the dead girl – all become murder suspects in the death of that girl. All three of these young suspects are 19 years old. They don't know each other, but quickly become fugitives from the law. To clear their names they work to uncover the truth behind the girl's death."},
{"id":"87e52582-d486-44d7-9ed8-0576ada13b16","releaseYear":"2009","title":"Heaven's Postman","origin":"South_Korean","director":"Unknown","cast":"Lee Hyung-min","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Heaven%27s_Postman","plot":"Jae-joon used to be a promising young CEO of an IT company, until he unexpectedly becomes a postman. He delivers the letters grieving people have written to their loved ones in Heaven. One day, he comes across Hana, who writes a letter full of resentment to the dead man that she used to love, and reveals his presence to her. Jae-joon proposes that Hana delivers responses which come back from Heaven and the two think up various ways to give peace and happiness to those who are alive and left behind, sometimes by writing the responses themselves. But a human being and a postman from Heaven cannot spend unlimited time together. As they start to grow feelings for each other, Jae-joon tries to pull himself away from Hana and the two, for the last time, deliver a response to an owner of a coffeehouse who had been agonizing for a long time over the loss of his son.[4]"},
{"id":"126cd649-0eb6-4efb-a51c-13fcfec0614b","releaseYear":"2009","title":"Triangle","origin":"South_Korean","director":"Unknown","cast":"Ji Yeong-soo","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Triangle_(2009_South_Korean_film)","plot":"Ji-young is a beautiful widow of an extremely wealthy family who finds herself attracted to Sang-woo, whom she meets at a ski resort. Sang-woo is the CEO of a company that arranges art exhibitions, and Ji-young finds him different from the gold diggers who usually come on to her. She starts opening up to him, because he is gentle-natured and seems to be rich enough not to want her for her money. But actually, Sang-woo is a con artist who only has ₩4,000 left to his name. He approached her because he has his eye on an art piece called "},
{"id":"dfef2adb-3da2-4101-b17a-eb68fa0dc421","releaseYear":"2009","title":"Flight","origin":"South_Korean","director":"Unknown","cast":"Park Jeong-hoon","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Flight_(2009_film)","plot":"Si-bum dreams of becoming an actor. One day, he meets Su-kyoung and falls in love with her at first sight. With Si-bum around, Su-kyoung seems to get over her depression and her strained relationship with her father, but suddenly Su-kyoung disappears to confront her mother’s death. After receiving contact, Si-bum meets up with Su-kyoung at the sea and both escape their realities. Su-kyoung becomes severely injured in an accident, and in desperately struggling to save her, Si-bum steals money to pay her hospital bills. However, he had stolen from a gang who catches and forces him to work as a male escort. Si-bum uses his acting skills to cheer up a recovering Su-kyoung pretending he makes a living from acting. As his popularity rises as an escort, he follows Ho-su, his boss and mentor, to make more money in Seoul. One day he comes across one of his old friends and gets involved in a big fight."},
{"id":"3b0c2101-56bb-40dd-b4f5-bd49564e54f7","releaseYear":"2009","title":"Actresses","origin":"South_Korean","director":"Unknown","cast":"E J-yong","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Actresses_(film)","plot":"Six actresses—Youn Yuh-jung,[7][8][9] Lee Mi-sook, Go Hyun-jung, Choi Ji-woo, Kim Min-hee and Kim Ok-bin, each portraying themselves—come together for a Vogue Korea magazine photo shoot at a studio in Cheongdam-dong, Seoul on Christmas Eve, resulting in a clash of egos between individuals not used to sharing the limelight."},
{"id":"d0478cff-1fb3-40ab-b58c-7b30c489280e","releaseYear":"2009","title":"Girlfriends","origin":"South_Korean","director":"Unknown","cast":"Kang Suk-bum","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Girlfriends_(2009_film)","plot":"29-year-old Song-yi (Kang Hye-jung) starts dating her handsome co-worker Jin-ho (Bae Soo-bin). But when she suspects Jin-ho might be cheating on her, she sets out to meet the "},
{"id":"8cefb3ec-e219-4baa-b20b-41a386d13e8b","releaseYear":"2010","title":"A Barefoot Dream","origin":"South_Korean","director":"Kim Tae-kyun","cast":"Park Hee-soon","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/A_Barefoot_Dream","plot":"Kim Won-kang (Park Hee-soon) is a former football prospect whose life did not turn out quite as he had hoped. He heads to East Timor, where he thinks there will be plenty of opportunities for him. One day, he sees a group of street kids playing football with bare feet. Thinking he can score by selling football shoes, he opens a sports equipment store, but realizes none of the kids can afford those fancy shoes or jerseys. Again, despaired, he is about to close up the store. Then, he decides to teach the kids how to play football. Penniless and still without shoes, they decide to compete at the International Youth Football Championship in Japan."},
{"id":"65cffe0b-38dc-407d-bec8-3519c86a1c8a","releaseYear":"2011","title":"GLove","origin":"South_Korean","director":"Unknown","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Glove_(film)","plot":"Kim Sang-nam (Jung Jae-young), a hot-tempered professional baseball player, is sent to the countryside to coach a team of hearing-impaired players in order to avoid media coverage of his recent involvement in an assault case. At first, Sang-nam has a difficult time imagining how he can teach baseball to a group of boys who can’t hear, but as he spends time with them he starts to believe that they can play the game. Motivated, Sang-nam decides to help them prepare for the nationals. As Sang-nam trains them, he forms bonds with the players, as well as with the music teacher and baseball manager Ms. Na (Yoo Sun). But things don’t go the way Kim plans and their difficulties communicating with one another exacerbates the situation.[6]"},
{"id":"fe47b6d5-ad75-42cf-a281-20936b2fa1f1","releaseYear":"2011","title":"Night Fishing","origin":"South_Korean","director":"Unknown","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Night_Fishing_(film)","plot":"A man casually sets up for a fishing trip at the water's edge. Evening comes and a tug on his line presents him with the body of a woman. While he tries to disentangle himself from the fishing lines, she comes alive. The scene changes and the woman is now a shaman priestess in a funeral ritual for a man who drowned in a river. He speaks through her to his relatives, asking for forgiveness."},
{"id":"7b663e6e-96f3-4972-8767-7f3bbed22820","releaseYear":"2011","title":"Late Autumn","origin":"South_Korean","director":"Unknown","cast":"","genre":"romance","wikiPage":"https://en.wikipedia.org/wiki/Late_Autumn_(2010_film)","plot":"Washington state, US, the present day.[8] Anna (Tang Wei), an immigrant from China, has been in prison for seven years for the manslaughter of her husband (John Woo), who was jealous over her re-meeting her former boyfriend Wang Jing (Jun-seong Kim). Hearing that her mother has died and her brother John has arranged her bail, Anna is given 72 hours parole to visit her family in Seattle. On the coach she meets a young Korean man, Hoon (Hyun Bin), who borrows US$30 towards a ticket, and he gives her his watch as security, promising to pay her back later. Unknown to Anna, Hoon is a gigolo on the run from powerful businessman Steve (James C. Burns), who wants to kill him for having an affair with his Korean wife, Ok-ja (Jeong So-ra). Hoon meets Anna again in Seattle, and the pair spend time together. The next day he turns up at her mother's funeral, and gets into a fight with Wang at a restaurant afterwards. Anna tells him she has to return to prison on time, but Hoon doesn't give up so easily.[9]"},
{"id":"55bb8644-3444-43a5-a866-a2d742de0ffc","releaseYear":"2011","title":"Bleak Night","origin":"South_Korean","director":"Unknown","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Bleak_Night","plot":"Still mystified by his son's death, the father (Jo Sung-ha) of high school student Ki-tae (Lee Je-hoon) tries to track down his two best friends, classmates Hee-joon (Park Jung-min) and Dong-yoon (Seo Jun-young), to try to find an explanation. Through Ki-tae's classmate Jae-ho, the father meets Hee-joon, who says he cannot help as he moved schools "},
{"id":"f3405c0a-bb72-4160-8596-ea00fab359a3","releaseYear":"2011","title":"Hanji","origin":"South_Korean","director":"Unknown","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Hanji_(film)","plot":"Pil-yong is a middling civil servant who is gripped by guilt every time he sees his wife Hyo-kyung, who is half-paralyzed from a stroke induced by his affair with another woman. But he finds newfound purpose in life when he is assigned to revive Jeonju's hanji industry. Hanji is Korean traditional paper made from mulberry trees; it is known in Asia for its beauty, flexibility and high quality, can reportedly last a thousand years, and is used for writing and creating 2D images similar to painting as well as 3D objects such as chamber pots and tea service. What begins as a desperate attempt to be promoted at work turns into a consuming passion as Pil-yong discovers the beauty of the craft, and he joins other devotees (such as documentary filmmaker Ji-won) to reenact traditional methods of hanji-making under the moonlight."},
{"id":"83212f82-301c-45c1-907b-d74fdf6a0bee","releaseYear":"2011","title":"My Black Mini Dress","origin":"South_Korean","director":"Unknown","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/My_Black_Mini_Dress","plot":"Yoo-min (Yoon Eun-hye), Hye-ji (Park Han-byul), Soo-jin (Cha Ye-ryun) and Min-hee (Yoo In-na) were the best of friends in college. While majoring in theater and film at an elite university, they were united by their passion for Seoul's clubbing scene and luxury shopping, but life isn't so easy now that they're in the real world. Clueless about what to do with her life, Yoo-min takes up a job as an assistant to a famous TV scriptwriter in order to buy an expensive black mini dress (or "},
{"id":"3ad4a0f6-463a-4008-8de1-398717dbce7c","releaseYear":"2011","title":"Romantic Heaven","origin":"South_Korean","director":"Unknown","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Romantic_Heaven","plot":"Three seemingly disconnected people cross paths at a hospital: Part one, "},
{"id":"34291e0e-b92f-48d3-bfdd-97138d35f913","releaseYear":"2011","title":"Meet the In-Laws","origin":"South_Korean","director":"Unknown","cast":"","genre":"romance/comedy","wikiPage":"https://en.wikipedia.org/wiki/Meet_the_In-Laws_(2011_film)","plot":"Naive, pure-hearted Hyun-joon writes romance comics under the pseudonym "},
{"id":"cae10839-b7c6-40b7-b208-4a59b8aba670","releaseYear":"2011","title":"I Am a Dad","origin":"South_Korean","director":"Unknown","cast":"","genre":"action","wikiPage":"https://en.wikipedia.org/wiki/I_Am_a_Dad","plot":"Han Jong-sik (Kim Seung-woo) is a corrupt detective who frames innocent people to further his career. One of his victims takes his revenge on Jong-sik by killing his wife and injuring his daughter, Min-ji (Kim Sae-ron), who is now in need of a heart transplant. To help his sick daughter, he starts working for a mob boss who deals in organ trafficking. Na Sang-man (Son Byong-ho), a magician and one of the people he falsely accused of murder, discovers that his daughter is dead and his wife is in a coma because of a suicide attempt. Now, the only thing on his mind is vengeance. He is released after two years behind bars when the officials find out by accident that he is innocent. He tracks down Detective Kim (Im Ha-ryong), Jong-sik's colleague, to re-open the murder case. Meanwhile, Soo-kyung (Choi Jung-yoon), the organ transplant coordinator, locates a heart for Min-ji, but Jong-sik finds out that the heart is from Sang-man's wife. Realizing that Sang-man would not allow the transplant, he finds a way to get rid of him. Sang-man discovers his plans and kidnaps his daughter.[3][4]"},
{"id":"6c5e2921-1a34-4c50-ba8d-a66c8badfa84","releaseYear":"2011","title":"Poongsan","origin":"South_Korean","director":"Unknown","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Poongsan","plot":"A man simply known as "},
{"id":"1bbafe31-6174-4f5b-b18e-7538738dd45c","releaseYear":"2011","title":"Hindsight","origin":"South_Korean","director":"Unknown","cast":"","genre":"film noir","wikiPage":"https://en.wikipedia.org/wiki/Hindsight_(2011_film)","plot":"Busan, South Korea, the present day. Legendary retired gangster Yoon Doo-hun (Song Kang-ho) dreams of opening a restaurant, and enrolls in a cooking class, where he gets to know Jo Se-bin (Shin Se-kyung). Doo-hun then hears that his former boss, Man-gil, has died after being hit by a car; the gang's members need to find Man-gil's will to see whom he nominated as his successor, though most of them expect it is Doo-hun. Meanwhile, Se-bin's roommate Lee Eun-jung (Esom) has become indebted to some Haeundae moneylenders, who force Se-bin, in return, to spy on Doo-hun. After Eun-jung steals a suitcase containing cocaine from the moneylenders, Se-bin is ordered to kill Doo-hun but can't bring herself to do it. Instead, Eun-jung tries to run him over with a car and subsequently disappears. Doo-hun survives and takes over as head of his old gang, intent on discovering who killed Man-gil. Among various problems, he has to contend with Baek Kyung-min (Lee Jong-hyuk), an ambitious young member of the gang, and his continuing relationship with Se-bin, who is under pressure from assassination agency head Madame Kang (Youn Yuh-jung) to kill him.[5][6][7]"},
{"id":"8ccfaaab-6695-4fa9-abb1-d13cbfdf0a22","releaseYear":"2011","title":"Dream Factory","origin":"South_Korean","director":"Unknown","cast":"","genre":"documentary","wikiPage":"https://en.wikipedia.org/wiki/Dream_Factory_(film)","plot":"Four friends in Beijing—three men and a woman—start a company which specializes in fulfilling their clients' dreams. Enacting their wildest fantasies, they encounter many oddball clients along the way."},
{"id":"98661923-5bb1-43b8-920a-cb84c4fe9623","releaseYear":"2011","title":"Champ","origin":"South_Korean","director":"Unknown","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Champ_(2011_film)","plot":"Two damaged souls race together for the race of their lifetime. Horse jockey Seung-ho loses his wife in a fatal car accident. The accident also leaves him practically blind. No longer able to work, he leads an aimless life with his little daughter. Things take turn for the worse when he loses all his savings after trying to cheat at the horse track and flees to a remote ranch in Jeju Island. There he meets a violent and limping horse named Woo-bak and he trains the horse for racing. Against all odds, Seung-ho and Woo-bak finish first in the preliminaries but when Seung-ho's blindness is discovered by the officials, they're disqualified from the finals. Woo-bak rejects all other jockeys and waits for Seung-ho to come back. The limping horse and his blind jockey bet everything to race one last time."},
{"id":"0a2b91ce-cb6a-47cb-9c30-c9119f80b53b","releaseYear":"2011","title":"Marrying the Mafia IV","origin":"South_Korean","director":"Unknown","cast":"","genre":"comedy","wikiPage":"https://en.wikipedia.org/wiki/Marrying_the_Mafia_IV","plot":"Hong Deok-Ja continues to run a kimchi food company and leaves for Japan on a business trip with three sons. However, when bank robbers steals their money, the family is separated from their guide,and a misunderstanding between language barriers makes the White Tiger family think that they are wanted by the cops."},
{"id":"f2ab9b98-85b2-42c5-97e4-d93107190c71","releaseYear":"2011","title":"Pained","origin":"South_Korean","director":"Unknown","cast":"","genre":"melodrama","wikiPage":"https://en.wikipedia.org/wiki/Pained","plot":"Debt collector Nam-soon (Kwon Sang-woo) lost his sense of pain after a traumatic accident during his youth, and now regularly takes beatings for his job. Street vendor Dong-hyun (Jung Ryeo-won) suffers from severe hemophilia, a disorder that impedes the body's ability to stop bleeding. For Dong-hyun, even the most minor of injuries could be deadly. She's left homeless after Nam-soon collects the last of her money, so he decides to take her in. As the two grow closer, Nam-soon suddenly begins to lose his lifelong insensitivity to pain and the hurt of a lifetime washes over him. Together, these two lonely souls learn to hurt and hope again..."},
{"id":"df41ab6b-7c55-402a-935f-b02b220a29b3","releaseYear":"2011","title":"Ashamed","origin":"South_Korean","director":"Unknown","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Ashamed_(2010_film)","plot":"Arts professor Jung Ji-woo (Kim Sang-hyun) is searching for a nude model for a video clip that she will play at her exhibition. When Hee-jin (Seo Hyun-jin), one of her students, recommends Yoon Ji-woo (Kim Hyo-jin) for the job, the three women head to the beach to shoot the video. As they spend time together, Yoon Ji-woo begins to share pieces of her past relationship with Kang Ji-woo (Kim Kkot-bi). The film weaves through the pasts and presents of the three Ji-woos and focuses on their intersecting relationship.[6][7]"},
{"id":"1fa83bbd-425b-45f1-bdfa-59c7b54948ac","releaseYear":"2011","title":"Always","origin":"South_Korean","director":"Unknown","cast":"","genre":"melodrama","wikiPage":"https://en.wikipedia.org/wiki/Always_(2011_film)","plot":"Having closed himself away from the world, former boxer Cheol Min starts a new part-time job as a parking lot attendant. One night, He is sitting in the tiny pay booth in the parking lot and staring at the small television when a young woman, Jung Hwa, walks into the tollbooth. She offers something to Cheol-min and sits next to him. Cheol-min realizes the woman is blind and she is confusing him for the parking attendant who worked there previously. Their lives change forever from this point."},
{"id":"7cec74ca-794c-4fb4-9765-a02922319cd3","releaseYear":"2013","title":"Azooma","origin":"South_Korean","director":"Lee Ji-seung","cast":"Jang Young-nam","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Azooma","plot":"Seoul, the present day. Ten-year-old Yeon-joo (Lee Jae-hee) is picked up outside school by a man (Hwang Tae-kwang) who says he knows her mother and is then driven to a flat where she is sexually abused. Six hours later, her mother, Yoon Young-nam (Jang Young-nam), reports her disappearance to the police, who say it is too soon to launch a proper investigation. After being found dumped on the street in a suitcase, Yeon-joo is taken to a hospital by Yoon and recovers; however, Yoon's ex-husband, TV celebrity dentist Dr. Lee (Bae Sung-woo), is not happy at the adverse publicity Yoon's action has generated. Yoon eventually persuades a busy detective, Ma (Ma Dong-seok), to take an interest in the case; he questions Yeon-joo in hospital but the child reveals little. Later, a female police officer questions her, with more success. Angry at the apparent slowness with which the police are treating the case, Yoon tracks down the child molester herself and confronts him at his flat. After a struggle and chase, the police arrive and take both of them in, though en route the child molester escapes. Yoon decides to take more radical action.[7][8][9]"},
{"id":"f74dffcf-57c7-41ff-82d8-cabc7a3972eb","releaseYear":"2013","title":"Fasten Your Seatbelt","origin":"South_Korean","director":"Ha Jung-woo","cast":"Jung Kyung-ho","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Fasten_Your_Seatbelt_(film)","plot":"A plane headed from Tokyo's Haneda Airport to Seoul's Gimpo Airport with a Hallyu star on board runs into an unexpected storm and is in danger of crashing. A plane full of absurd characters―both crew members and passengers such as a businessman, a monk and a paparazzo—go through a series of comical shenanigans."},
{"id":"705e062f-6025-4079-9fb6-32c7794b8501","releaseYear":"2013","title":"Rough Play","origin":"South_Korean","director":"Shin Yeon-shick","cast":"Lee Joon","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Rough_Play","plot":"Oh Young (Lee Joon) is an intense young actor, full of vigor for his chosen field. He currently performs regularly for a small theater company as well as playing minor roles in movies. A manager named Kim Jang-Ho (Seo Bum-Suk) then spots Oh Young on the filming set of a movie. He sees potential in Oh Young and offers to make him a top actor. After signing his contract, Oh Young's role in the movie is rewritten into a major supporting character. Once the movie is released, Oh Young receives praise for his performance and also becomes a burgeoning celebrity. As his popularity rises, Oh Young's life quickly spirals out of control."},
{"id":"189a4dcb-1fb7-48d2-a605-edc466c9b9f6","releaseYear":"2013","title":"The Suspect","origin":"South_Korean","director":"Won Shin-yun","cast":"Gong Yoo","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Suspect_(2013_South_Korean_film)","plot":"Ji Dong-chul (Gong Yoo) was once one of the top special forces agent in North Korea, but after a change in political system, he was abandoned by his government while on a mission. He goes on the run, seeking his wife and daughter who were sold as slaves to China, only to discover their corpses. When he learns that an ex-colleague was behind their deaths, Dong-chul goes on a vendetta for revenge, defecting to the South to chase his family's killer. Now living incognito, he searches for his nemesis during the day, and at night works as a personal chauffeur for Chairman Park, a business executive with ties to Pyongyang. One night the chairman is attacked and killed by an assassin, but not before handing over a special pair of glasses to Dong-chul. The South Korean intelligence service, a member of which frames Dong-chul for the murder, goes on the hunt for the beleaguered former spy. The manhunt is led by Min Se-hoon (Park Hee-soon), a colonel and drill sergeant with whom Dong-chul shares a past, and Kim Seok-ho (Jo Sung-ha), the director of the NIS. Aided by a feisty documentary filmmaker (Yoo Da-in), Dong-chul goes on the run again while trying to recover top-secret materials that his dying boss sent him to find.[5][6]"},
{"id":"6332c6d7-03c3-420f-89f4-2292c545109f","releaseYear":"2014","title":"Another Promise","origin":"South_Korean","director":"Kim Tae-yun","cast":"Park Chul-min","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Another_Promise","plot":"Shortly after graduating from high school, Yoon-mi begins looking for a job in order to earn money to help support her struggling family; she especially wants to pay for her younger brother Yoon-seok's tuition when he goes to college in the next few years. Her father Sang-gu, a taxi driver in Gangwon Province, is proud and overjoyed when Yoon-mi gets hired as a factory worker at the Jinsung semiconductor factory. But just two years later he learns that his daughter has been diagnosed with leukemia; four years after her diagnosis, Yoon-mi dies in the backseat of Sang-gu's cab. After learning that a number of Yoon-mi's coworkers at the factory are also suffering unlikely diseases, Sang-gu is convinced that Jinsung is responsible for his late daughter's disease and death. He makes a visit to a labor attorney to file a claim against the most powerful conglomerate in the country. Sang-gu and his family, along with their attorney and other families of leukemia patients, are soon shaken up as the company uses different methods of appeasement and pressure to keep the families from uniting, among them offering money to keep the issue from becoming public. Jinsung workers also spy on the families of the plaintiffs, stalk them and threaten them, all for the sake of their company, which they genuinely believe to be in the right. People become reluctant to be a witness for trial, either because of their loyalty to the company or for the well being of their families. But Sang-gu is determined to continue in his quest for truth and justice."},
{"id":"4cd57951-35bf-49e1-b1fb-28021600ed7f","releaseYear":"2016","title":"A Korean in Paris","origin":"South_Korean","director":"Jeon Soo-il","cast":"Cho Jae-hyun","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/A_Korean_in_Paris","plot":"Korean newlyweds are on their honeymoon in Paris. Strolling in the Pigalle area, the young bride sees in a red dress in a store window and she enters the shop. Her husband goes to buy cigarettes while he waits for her. When the man comes back his wife has disappeared. Not speaking a word of French he desperately searches for her. A search that will turn into a free fall into a world ruled by illegality, prostitution, drugs, a universe with its own codes and punishments.[1]"},
{"id":"1f65934e-ce98-48f7-9db6-1e7505d2d885","releaseYear":"2016","title":"Steel Flower","origin":"South_Korean","director":"Park Suk-young","cast":"Jeong Ha-dam","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Steel_Flower","plot":"A young homeless girl, Ha-dam, moves to Busan in the hopes of finding work, only to be rebuffed at every turn."},
{"id":"413123ce-9471-4359-839c-5240cb5a3fad","releaseYear":"2017","title":"On the Beach at Night Alone","origin":"South_Korean","director":"Hong Sang-soo","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/On_the_Beach_at_Night_Alone","plot":"Young-hee is a washed up actress who is stressed by a relationship with a married man in Korea. On the beach she wonders: Is he missing me, like I miss him? The opening scene depicts a young woman on the beach, contemplating her life and the meaning of love and identity."},
{"id":"7b3ea36c-3c7b-4997-8865-f10718bf5284","releaseYear":"2017","title":"Fork Lane","origin":"South_Korean","director":"Lee Ju-hyoung","cast":"Uhm Tae-woong","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Fork_Lane","plot":"Kim Gang-il, a paratrooper who was mobilized to suppress the demonstrations during the May 18th Gwangju Democratization Movement, is working as a forklift driver after his retirement. Subsequently, he uncovers findings that will reveal the inconvenient truth from twenty years prior."},
{"id":"d4e340f0-c100-4d8d-8ebc-723771c8e972","releaseYear":"2009","title":"Gökten Üç Elma Düştü","origin":"Turkish","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/G%C3%B6kten_%C3%9C%C3%A7_Elma_D%C3%BC%C5%9Ft%C3%BC","plot":"Ali, a young petty thief, runs away from home and seeks refuge with his grandfather in Istanbul. His grandfather, an ex-military disciplinarian who at first did not even recognize his own grandson, is involved in a feud with his upstairs neighbor Nilgun, a middle-aged prostitute. We learn they are not quite what they appear to be in a spiraling chain of events that makes these three seemingly antagonistic characters come closer and closer together."},
{"id":"42535bb9-d681-4e31-a7d9-a8a3dfec22fa","releaseYear":"2009","title":"Yengeç Oyunu: Adalet","origin":"Turkish","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Yenge%C3%A7_Oyunu:_Adalet","plot":"Asya (Ayça İnci) is a research assistant working in the history department of a university in İstanbul. Taking her 5-year-old daughter with her, Asya embarks on a journey back to her hometown with the dream of starting over again. There she gets a new job at a school. She starts working on a project that is about to change her entire life along with that of her students. While conducting research on old Ottoman court documents, Asya and her students come across an interesting incident. In the year 1917, a local mobster called Yengeç Salih killed a midwife called Nuriye, claiming that she was a prostitute. Charges were dropped against Salih when he told the court that he killed the woman for the sake of the neighborhood's reputation. The students, struck with the injustice in this case, decide to reenact the case and try Salih one more time."},
{"id":"a4e7d892-b6a4-4eaa-9202-28ca8a9e706a","releaseYear":"2009","title":"Dilber'in Sekiz Günü","origin":"Turkish","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Dilber%27in_Sekiz_G%C3%BCn%C3%BC","plot":"Dilber lives with her family in a very poor eastern village, her only dream is to marry her childhood lover, Ali. But when she finds out that it won't happen because of a reason that she can't get away with, she gets crazy and lock herself up in her family's barn. Then she makes everybody knows that she'll marry the first guy who proposes and won't leave the barn till that happens. One day, a limping man comes to the village. He's alone and has heard that there's a girl in that village who's ready to marry him."},
{"id":"aa024d63-5e25-465e-a032-bfd774d2ccc8","releaseYear":"2009","title":"Usta","origin":"Turkish","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Master_(2009_film)","plot":"Dogan, a car mechanic in a small town, is obsessed with flying. He has been building a small biplane in his back yard for years. His wife Emine does not share his affinity for aviation and feels neglected in their marriage. When Dogan's plane crashes during an aeronautics fair, she gives him an ultimatum: he can either pursue his passion for flying or live a humble life with her, solely as a car mechanic."},
{"id":"3bd74a18-6d73-454a-b21e-bbc2199faa55","releaseYear":"2009","title":"Çingirakli Top","origin":"Turkish","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Ringing_Ball","plot":"The film follows a handful of blind people, including a fisherman, a call-center agent and a man who sells lottery tickets on the street, from the Bosporus Society for the Blind, training to compete in the soccer category at the Paralympics. Kerem (Burak Önal), a former soccer star who has become an alcoholic coaches the team and falls in love with the beautiful Semra (İpek Özkök), a young woman works for the society. Unfortunately, Kerem has some thugs on his tail due to his past debts and his weakness for wine puts his coaching activities in danger."},
{"id":"c7b90861-b1ca-419e-b669-5f87eee78f7b","releaseYear":"2009","title":"Karanliktakiler","origin":"Turkish","director":"Çağan Irmak","cast":"","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Karanliktakiler","plot":"Egemen is an advertising agency clerk in his thirties who has to share a roof with his mentally ill mother, Gülseren. Having to endure his mother’s anxieties and mental black outs, his only outlet is his workplace; where he feels he can breathe and escape the hell that is his home, even if it is for a little while. But Egemen’s amorous interest in his boss Umay unveils little by little just how much Gulseren has emotionally damaged her son."},
{"id":"b3fcdfc7-0d04-4e69-869d-1fbd7efdece7","releaseYear":"2009","title":"Acı","origin":"Turkish","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/The_Pain_(film)","plot":"Nesrin is a young girl fighting for freedom, while the grandfather Hıdır defends the family values. Through the story of Hıdır and Nesrin, the film brings forward the issues of identity, toleration, leniency, cultural differences and ethics. “Pain” is a universal story on the necessity of saying “no!” for a humanely life."},
{"id":"62d854e4-ed4b-4a0d-b17a-b493908e0278","releaseYear":"2009","title":"The Watercolor","origin":"Turkish","director":"Cihat Hazardagli","cast":"","genre":"animation","wikiPage":"https://en.wikipedia.org/wiki/The_Watercolor","plot":"Twelve-year-old Marco has an exclusive talent for drawing. Eighteen-year-old beautiful Lorella who was brought up by three street artists, becomes Marco’s art teacher. Marco falls in love with her. Not only he discovers art, but love and sexuality. Unfortunately Marco’s love is one sided. Lorella is in love with an art collector who despises watercolor. Marco collects every drawing he can get a hold of. His goal is to become the greatest watercolor collector of the world. He helps the poor street artists and they give him all their drawings. When Marco turns 30, he opens the boxes he kept in the attic. What he finds will change his life."},
{"id":"c82e50ea-1815-4a22-a227-4b0902aab13c","releaseYear":"2009","title":"Acı Aşk","origin":"Turkish","director":"A. Taner Elhan","cast":"Ezgi Asaroglu","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Ac%C4%B1_A%C5%9Fk","plot":"Orhan, who works as a literature professor at a university in Eskisehir (a city in Central Anatolia), unexpectedly ends his relationship with Ayşe whom he was planning to marry, and comes to Istanbul where he meets Oya. After living possibly the happiest days of his life with Oya, who is a photographer, Orhan finds himself in the midst of a challenging love triangle as a result of the horrible things they encounter the first days of their marriage. Meanwhile, his new student Seda, pulls Orhan towards a point of no return. Tough days are ahead for Orhan whose life is turned upside down, torn between three women."},
{"id":"81bfe8d7-e536-49c5-a43a-1ece68124023","releaseYear":"2009","title":"Orada","origin":"Turkish","director":"Unknown","cast":"","genre":"unknown","wikiPage":"https://en.wikipedia.org/wiki/Orada","plot":"When the matriarch of an Istanbul family dies in a home for the elderly, the son and the daughter bury their mother and set off to find their father, a recluse in the family house on one of the Princes' Islands. As the three members of the family come together, it turns into a day of painful confrontations."},
{"id":"84954bc4-9bee-447b-8205-75619e52e889","releaseYear":"2010","title":"One Day in the Future","origin":"Turkish","director":"Bogachan Dündar","cast":"Hayrettin Karaoguz & Hande Subasi","genre":"comedy","wikiPage":"https://en.wikipedia.org/wiki/One_Day_in_the_Future","plot":"Tolga (Hayrettin Karaoğuz), having struggled with bad luck all his life, believes he is a total loser and the unluckiest man in the whole world. Following an unsuccessful presentation of his new project at work, he is fired. Believing he has ruined his last chance to win over the love of his life (Hande Subaşı), he commits suicide. After he dies, he is met by two angels (Rasim Öztekin and Arda Kural), who, as a punishment, show Tolga scenes from how his life would have been in the future if he had not committed suicide."},
{"id":"92c8ec35-e8bf-4492-a1d7-afa0321a84c0","releaseYear":"2010","title":"Dragon Trap","origin":"Turkish","director":"Uğur Yücel","cast":"Uğur Yücel & Kenan İmirzalıoğlu","genre":"thriller","wikiPage":"https://en.wikipedia.org/wiki/Dragon_Trap","plot":"Ensar (Nejat İşler) has turned into a ruthless death machine during his military service, during which he fought terrorists in numerous clashes in southeast Anatolia. Having just completed his compulsory military service, Ensar returns home, but on the very day he comes home, he finds out that while he was away, his 12-year-old sister was raped. Later, unable to cope with the trauma, the little girl hanged herself at a mental asylum she was put in following the incident. In the meantime, Ensar’s hometown is shaken with a number of murders. Two skillful detectives from the homicide department, Abbas (Uğur Yücel) and “Akrep” Celal (Kenan İmirzalıoğlu), along with rookie Ezo (Berrak Tüzünataç) are assigned to investigate the murders. The case will be the last one Abbas has to solve before the retirement he has been anticipating for a long time to put into practice his plans to move to a quiet and far away place with his longtime girlfriend Cavidan (Ceyda Düvenci)."},
{"id":"414bcfe9-302f-40a9-a7cb-3bf0c132fd58","releaseYear":"2010","title":"Ada: Zombilerin Düğünü","origin":"Turkish","director":"Murat Emir Eren & Talip Ertürk","cast":"Ozan Ayhan & Esra Ruşan","genre":"horror","wikiPage":"https://en.wikipedia.org/wiki/Ada:_Zombilerin_D%C3%BC%C4%9F%C3%BCn%C3%BC","plot":"A group of friends gather to attend a wedding on a remote island in Istanbul. During the event, zombies appear and attack the guests. All of the events and the group's attempts to survive the zombie invasion are recorded on a camcorder by one of the friends.[3]"},
{"id":"0fcb9646-def8-4214-8d02-9c01874df724","releaseYear":"2010","title":"Eyvah Eyvah","origin":"Turkish","director":"Hakan Algül","cast":"Demet Akbag & Ata Demirer","genre":"comedy","wikiPage":"https://en.wikipedia.org/wiki/Eyvah_Eyvah","plot":"Hüseyin (Ata Demirer) is a young man living with his grandparents in a village in Turkey’s Thracian region. Two things are of great importance in Hüseyin’s life: his clarinet and his fiancee. However, one day Hüseyin is forced to go to İstanbul and leave behind his beloved village. In the big city, Hüseyin will receive the biggest support from his clarinet and later from a bar singer called Firuzan (Demet Akbağ). Firuzan, who storms İstanbul’s night clubs with her songs, already leads a very colorful and highly complicated life, which, with Hüseyin’s inclusion, gets all the more colorful with comedy and action."},
{"id":"ff52b16a-88ed-46d1-ad54-87e4eeb945b8","releaseYear":"2010","title":"Lost Songs of Anatolia","origin":"Turkish","director":"Nezih Ünen","cast":"","genre":"documentary","wikiPage":"https://en.wikipedia.org/wiki/Lost_Songs_of_Anatolia","plot":"A musical journey among the many historic places and ethnic peoples of Anatolia, this documentary offers live recordings of 20 lesser-known or forgotten local folksongs, performed by the native artists of that particular region."},
{"id":"ee93536f-d66a-4185-a62c-6f14afb8c7a9","releaseYear":"2010","title":"Honey","origin":"Turkish","director":"Semih Kaplanoğlu","cast":"Erdal Beşikçioğlu","genre":"drama","wikiPage":"https://en.wikipedia.org/wiki/Bal_(film)","plot":"In the remote and undeveloped eastern Black Sea region, a six-year-old boy (Yusuf) wanders through the woods searching for his lost father, trying to make sense of his life.[5] His father is a beekeeper whose bees have disappeared unexpectedly, threatening his livelihood.[5] A bizarre accident kills the father.[8] There is little dialogue or music in the film.[5] The three main characters (Yusuf and his parents) are all fairly taciturn, and the soundtrack is filled out with the sounds of the forest and the creatures that live there.[9] The environment is a recurring theme.[10]"}
]